Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/index.po
Languages: es_la

source: About
es_la: Acerca de

source: Episodes
es_la: Episodios

source: JupyterHub Administration to Empower Research Communities
es_la: Administración de JupyterHub para impulsar las comunidades de investigación

source: {bdg-danger}`alpha` Lesson is under active development.
es_la: {bdg-danger}`alpha` La lección está en desarrollo activo.

source: Catalyst Project logo
es_la: Logo del Proyecto Catalyst

source: This lesson is aimed at Hub Champions in charge of 2i2c managed JupyterHubs in the cloud. Learn the fundamentals of administering your hub and providing user support to your research and education communities.
es_la: Esta lección está dirigida a las Personas Campeonas del Hub a cargo de los JupyterHubs en la nube administrados por 2i2c. Conoce las bases de la administración de tu hub y proporciona soporte a las personas usuarias de tus comunidades de investigación y educación.

source: Training is delivered over two synchronous workshops, each one hour in length a week apart. The week in between is dedicated to self-guided study with asynchronous support provided by the instructors, which we estimate at least four hours of work.
es_la: La formación se imparte en dos talleres sincrónicos con una duración de una hora cada uno, y con una semana de intervalo entre ellos. La semana intermedia se dedica al estudio autoguiado con apoyo asincrónico proporcionado por las personas instructoras, en la cual estimamos por lo menos cuatro horas de trabajo.

source: Lesson objectives
es_la: Objetivos de la lección

source: After attending this training, Hub Champions will be able to:
es_la: Después de asistir a esta formación, las Personas Campeonas del Hub podrán:

source: explain how interactive cloud computing can empower their user community
es_la: explicar cómo la computación interactiva en la nube puede impulsar a su comunidad de usuarios y usuarias

source: control user authentication and access to their hub
es_la: controlar la autenticación de los usuarios y usuarias, y el acceso a su hub

source: promote the use of cloud resources responsibly to maximize efficiency and minimize carbon emissions
es_la: promover el uso responsable de los recursos en la nube para maximizar la eficiencia y minimizar las emisiones de carbono

source: apply software environments through containerization
es_la: aplicar entornos de software mediante contenedores

source: navigate the filesystem and transfer data and code to and from the hub
es_la: navegar por el sistema de archivos y transferir datos y códigos desde y hacia el hub

source: provide user support and troubleshoot common issues
es_la: proporcionar soporte a usuarios y usuarias y resolver problemas comunes

source: Episode 1
es_la: Episodio 1

source: Episode 2
es_la: Episodio 2

source: Episode 3
es_la: Episodio 3

source: Episode 4
es_la: Episodio 4

source: Episode 5
es_la: Episodio 5

source: Episode 6
es_la: Episodio 6

source: ( ⭐ indicates this episode is delivered via a one hour synchronous workshop)
es_la: ( ⭐ indica que este episodio se proporciona mediante un taller sincrónico de una hora)

source: Acknowledgements and Funding
es_la: Agradecimientos y financiamiento

source: We would like to acknowledge Chan Zuckerberg Initiative funding for The Catalyst Project "A Collaborative Interactive Computing Service Model for Global Communities" and our partner organisations:
es_la: Queremos agradecer el financiamiento de la Iniciativa Chan Zuckerberg para el Proyecto Catalyst, "Un modelo de servicio informático interactivo y colaborativo para las comunidades globales", y a nuestras organizaciones asociadas:

source: Contacting us
es_la: Contacto

source: If you would like to get in touch with us, then please open an [issue](https://github.com/czi-catalystproject/hub-champion-training/issues) or email [support@2i2c.org](mailto:support@2i2c.org).
es_la: Si deseas ponerte en contacto, abre un [issue](https://github.com/czi-catalystproject/hub-champion-training/issues) o envía un correo electrónico a [support@2i2c.org](mailto:support@2i2c.org).
