Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/profiles/learner-profiles.po
Languages: es_419

source: Learner Profiles
es_419: Perfiles de los estudiantes

source: She graduated in Computer Science recently and has a support staff position in the biomedical engineering PhD program at the life sciences department in a medium-sized public university in Ecuador.
es_419: Recientemente se graduó en Ciencias de la Computación y trabaja en un puesto de soporte para el programa de Doctorado en Ingeniería Biomédica en el departamento de Ciencias de la Vida para una universidad pública de tamaño mediano en Ecuador.

source: María has to assist around 25 students and their advisors in struggling with hardware that is not necessarily old but does not hold the capacity to process the required “big data” for their projects promptly. Also, the projects are very different, so there isn’t a clear one-size-fits-all solution.
es_419: María debe ayudar a cerca de 25 estudiantes y a sus asesores a lidiar con hardware que no necesariamente es obsoleto, pero no tiene la capacidad de procesar rápidamente el “big data” necesario para sus proyectos. Además, los proyectos son muy diferentes, así que no hay una solución clara que sirva al mismo tiempo para todos.

source: The Hub Champion training will enable María to select and recommend the best software environments and computation resources for the students' project needs.
es_419: La formación para los Campeones y Campeonas del Hub le permitirá a María seleccionar y recomendar los mejores recursos de software y computación para cubrir las necesidades de los estudiantes para sus proyectos.

source: He is a biologist with some self-taught knowledge of Computer Science. He is part of a nonprofit organization working mainly in Mexico but with an internationally distributed team. The team has cross-disciplinary intersections with biology, pharmacy, media studies, and political science.
es_419: Es biólogo con un poco de conocimiento autodidacta en Ciencias de la Computación. Forma parte de una organización sin fines de lucro que trabaja principalmente en México, pero con un equipo que está distribuido internacionalmente. El equipo trabaja de manera multidisciplinaria con biología, farmacia, estudios de los medios de comunicación y ciencias políticas.

source: The community members have different levels of knowledge of interactive computing tools. Because of his better understanding of programming and computing concepts, Santiago was selected as the Hub Champion for the Catalyst Project.
es_419: Los miembros de la comunidad tienen diferentes niveles de conocimiento en herramientas de computación interactivas. Debido a que comprende mejor los conceptos de programación y computación, Santiago fue seleccionado como Campeón del Hub del Proyecto Catalyst.

source: The Hub Champion training will give Santiago more confidence and tools to make the best use of the hub in his community while he connects with other nonprofit organizations with similar challenges to share strategies.
es_419: La formación para los Campeones y Campeonas del Hub le dará a Santiago más confianza y herramientas para usar mejor el hub de su comunidad, a la vez que le permitirá conectarse con otras organizaciones sin fines de lucro que enfrentan desafíos similares para compartir estrategias.

source: She is a biochemist working on analyzing water quality on the coast of Peru. She is part of a climate data research group distributed on the Pacific Latin American coast, co-led by two other professors from public and private universities in Chile and Colombia.
es_419: Ella es bioquímica y trabaja en el análisis de la calidad del agua en las costas de Perú. Forma parte de un grupo de investigación sobre el clima que está distribuido en la costa del Pacífico latinoamericano, trabaja bajo la codirección de otros dos profesores de universidades públicas y privadas ubicadas en Chile y Colombia.

source: The project aims to understand the effects of El Niño on human health. They have been using each university’s computational resources for research, so they often use distinct tools and protocols and lack shared infrastructure and similar training. As part of the Catalyst Project, they want to develop a common workflow across the three universities and find a way to sustain the project for the next two decades due to the long timelines used in climate data.
es_419: El objetivo del proyecto es comprender los efectos de El Niño en la salud humana. Han estado utilizando los recursos computacionales de cada universidad para la investigación, así que a menudo utilizan herramientas y protocolos distintos, y carecen de infraestructura compartida y formación similar. Como parte del Proyecto Catalyst, quieren desarrollar un flujo de trabajo común entre las tres universidades y encontrar una manera de sustentar el proyecto durante las próximas dos décadas debido a los largos plazos que se requieren para la recopilación de datos sobre el clima.

source: The Hub Champion training will give Ana the knowledge to establish a workflow using open-source software that enables collaboration and facilitates reproducibility for the research project.
es_419: La formación para los Campeones y Campeonas del Hub le dará a Ana los conocimientos necesarios para establecer un flujo de trabajo utilizando software de código abierto que permite la colaboración y facilita la reproducibilidad del proyecto de investigación.
