Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/instructors/instructor-notes.po
Languages: es_419

source: Instructor Notes
es_419: Notas del instructor

source: Schedule
es_419: Programación

source: Training is delivered over two synchronous workshops, each one hour in length a week apart. The week in between is dedicated to self-guided study with asynchronous support provided by the instructors.
es_419: La formación se imparte en dos talleres sincrónicos con una duración de una hora cada uno, y con una semana de intervalo entre ellos. La semana intermedia se dedica al estudio autoguiado con apoyo asincrónico proporcionado por las personas instructoras.

source: ( ⭐ indicates this episode is delivered via a synchronous workshop)
es_419: ( ⭐ indica que este episodio se proporciona mediante un taller sincrónico)

source: Asynchronous support during self-study
es_419: Soporte asincrónico durante el estudio autodidacta

source: Your helper will populate the CodiMD with lesson content during the sync sessions. Make sure to paste the episode content ready for the self-paced study.
es_419: Tu ayudante llenará el CodiMD con el contenido de la lección durante las sesiones sincrónicas. Asegúrate de pegar el contenido del episodio que está listo para el estudio autodidacta.

source: We will use a collaborative note-taking document, to share answers to exercises during this workshop. A CodiMD template is available for you to use in the lesson repository under the *instructors* folder. Make sure you generate a fresh copy and remove the contents of each episode section before the workshop and share this with your learners.
es_419: Utilizaremos un documento para tomar notas de manera colaborativa y compartir las respuestas de los ejercicios durante este taller. Una plantilla de CodiMD está disponible para utilizarse en el repositorio de lecciones en la carpeta *instructors* (instructores). Asegúrate de generar una nueva copia, eliminar el contenido de cada sección de episodios antes del taller y compartirlo con tus estudiantes.

source: Set up a Slack channel, or equivalent, where learners ask for help and support during the training.
es_419: Configurar un canal de Slack, o equivalente, donde los estudiantes pidan ayuda y soporte durante la formación.

source: During the self-guided study portion of the workshop, make sure to check the CodiMD and Slack channel regularly to assess progress and respond to any questions.
es_419: Durante la parte de estudio autoguiado del taller, asegúrate de revisar el documento CodiMD y el canal de Slack regularmente para evaluar el progreso y responder a cualquier pregunta.

source: Notes for helpers
es_419: Notas para los ayudantes

source: Helpers support workshop instructors with tasks such as
es_419: Los ayudantes apoyan a los instructores del taller con tareas como

source: helping learners with lesson setup problems
es_419: ayudar a los estudiantes con problemas de configuración de las clases

source: populating the CodiMD with lesson content, e.g. episode questions, objectives, exercises and minute card feedback forms
es_419: llenar el CodiMD con el contenido de la clase, por ejemplo preguntas sobre los episodios, objetivos, ejercicios y formularios para los comentarios de las tarjetas de devoluciones de un minuto

source: monitoring the Slack channel
es_419: monitoreando el canal de Slack

source: grant administrator privileges to users on the Community Showcase Hub for users who have not logged into the hub before the lesson (see {ref}`Community Showcase Hub setup<community-showcase-hub-setup>`)
es_419: conceder privilegios de administrador a los usuarios en el Hub de muestra comunitario para los usuarios que no han iniciado sesión en el hub antes de la lección (consulta {ref}`Configuración del Hub de muestra comunitario<community-showcase-hub-setup>`)

source: keeping the instructor on track and on time
es_419: mantener al instructor en las actividades y tiempos planificados

source: reminding participants to complete feedback forms.
es_419: recordar a los participantes que completen los formularios de los comentarios.

source: Communication channels
es_419: Canales de comunicación

source: We will primarily use Slack for communications with learners to encourage a "cohort" effect and capture discussions that would otherwise disappear from Zoom/Google Meet chat. However, we recognise that learners may join the synchronous sessions on their phones and therefore the Zoom/Google Meet chat is useful in this case.
es_419: Utilizaremos principalmente Slack para las comunicaciones con los estudiantes para promover un efecto de "cohorte" y capturar discusiones que de otro modo desaparecerían del chat de Zoom/Google Meet. Sin embargo, reconocemos que los estudiantes pueden unirse a las sesiones sincrónicas en sus teléfonos y, por lo tanto, el chat de Zoom/Google Meet es útil en este caso.

source: Consider recording your workshop so that learners can refer back to this for later viewing.
es_419: Considera grabar tu taller para que los estudiantes puedan consultarlo y verlo más tarde.

source: Hidden curriculum
es_419: Plan de estudios oculto

source: Episode 6, Exercise 1
es_419: Episodio 6, Ejercicio 1

source: In Part One of the workshop, please notify learners that the self-study portion of the lesson ends *after* the completion of Episode 6, Exercise 1. The result of this exercise allows the instructor to ascertain the most common support issue raised by the learners in preparation for the "flipped classroom" experience in Part Two of the workshop, where the instructor live demonstrates the problem-solving skills required to troubleshoot and provide user support.
es_419: En la Parte 1 del taller, por favor avisa a los estudiantes que la parte de autoestudio de la lección termina *después* de completar el Ejercicio 1 del Episodio 6. El resultado de este ejercicio permite que el instructor averigüe el problema de soporte más común que plantean los estudiantes al prepararse para la experiencia de "clase invertida" en la Parte 2 del taller, donde el instructor demuestra las habilidades de resolución que se requieren para solucionar problemas y proporcionar soporte al usuario.

source: Time management
es_419: Gestión del tiempo

source: For the exercises, we encourage instructors not to read out answers already entered into the CodiMD and instead to ask learners more targeted follow up questions.
es_419: Para los ejercicios, animamos a los instructores a no leer las respuestas que ya se introdujeron en el CodiMD y, en vez de ello, hacer preguntas de seguimiento más específicas.

source: Extra resources
es_419: Recursos adicionales

source: Template [Google Slides](https://docs.google.com/presentation/d/1hrI70StR2ghGAIj-qxk06bxttWX7ff3yNQOM25HcBnQ/edit?usp=sharing) to supplement Episode 1 are available for you to use.
es_419: Las plantillas [Google Slides](https://docs.google.com/presentation/d/1hrI70StR2ghGAIj-qxk06bxttWX7ff3yNQOM25HcBnQ/edit?usp=sharing) (Diapositivas de Google) para complementar el Episodio 1 están disponibles.

source: (For internal use by the Catalyst Project team) A folder containing template feedback forms and a workshop folder for each training event can be found in the team [Google Drive](https://drive.google.com/drive/folders/1cElP_O-FdkM1-BbH6jO111M4mUVvU7H0?usp=drive_link).
es_419: (Para uso interno del equipo del Proyecto Catalyst) En el equipo [Google Drive](https://drive.google.com/drive/folders/1cElP_O-FdkM1-BbH6jO111M4mUVvU7H0?usp=drive_link), se puede encontrar una carpeta con plantillas y una carpeta de taller para cada evento de capacitación.

source: Pre-workshop Tasks
es_419: Tareas previas al taller

source: You may use the following email template to communicate with learners 1 week before the workshop.
es_419: Puedes usar la siguiente plantilla de correo electrónico para comunicarte con los estudiantes una semana antes de que inicie el taller.

source: Pre-workshop email template
es_419: Plantilla de correo previa al taller

source: Dear all,
es_419: Estimados asistentes,

source: Thanks for registering to attend The Hub Champion Training. This message contains all of the information you need to prepare for and join the workshop.
es_419: Gracias por registrarse para asistir a la formación de Campeones y Campeonas del Hub. Este mensaje contiene toda la información que necesitan para prepararse y unirse al taller.

source: **What do I need to do before the training?**
es_419: **¿Qué debo hacer antes de la formación?**

source: Before the training, please complete our pre-training survey.
es_419: Antes de la formación, completa nuestra encuesta previa a la formación.

source: Participants should be able to:
es_419: Los participantes deben ser capaces de:

source: Access the 2i2c [Community Showcase Hub](https://showcase.2i2c.cloud) using their GitHub account
es_419: Acceder al [Hub de muestra comunitario de 2i2c](https://showcase.2i2c.cloud) usando su cuenta de GitHub

source: Know basic Git, such as pushing and pulling to a remote GitHub repository
es_419: Conocer comandos básicos de Git, como hacer push y pull en un repositorio remoto de GitHub

source: Find the shared collaborative note-taking document, e.g. CodiMD (shared in the calendar invite)
es_419: Encontrar el documento compartido para la toma de notas colaborativas, por ejemplo, CodiMD (que se compartió en la invitación del calendario)

source: Access the 2i2c Slack #hub-champion-training channel for asynchronous support (Slack invite to be shared in the calendar invitate)
es_419: Acceder al canal del entrenamiento en el Slack de 2i2c (#hub-champion-training) para soporte asincrónico (link disponible en la invitación del calendario)

source: Use a web browser and video conferencing, e.g. Zoom
es_419: Utilizar un navegador web y servicios de videoconferencia, por ejemplo, Zoom

source: Read the [2i2c Code of Conduct](https://compass.2i2c.org/code-of-conduct/).
es_419: Lee el [Código de conducta de 2i2c](https://compass.2i2c.org/code-of-conduct/).

source: **When and where?**
es_419: **¿Cuándo y dónde?**

source: Training is delivered over two synchronous workshops, each one hour in length a week apart. The week in between is dedicated to self-guided study with asynchronous support provided by the instructors in a Slack channel you have been invited to.
es_419: La formación se imparte en dos talleres sincrónicos, cada uno de una hora de duración, separados por una semana. La semana intermedia está dedicada al estudio autoguiado con apoyo asincrónico proporcionado por los instructores en un canal de Slack al que te invitaron.

source: Part One is scheduled to take place *<insert time (including timezone) and date>* and the Part Two is scheduled to take place *<insert time (including timezone) and date>*. You should have received a calendar invitation including videoconferencing connection details, a Slack invite and a URL for the collaborative notes document we will use during the training.
es_419: La Parte 1 está programada para llevarse a cabo el *<completar con fecha y horario (incluyendo el huso horario)>* y la Parte 2 está programada para llevarse a cabo el *<completar con fecha y horario (incluyendo el huso horario)>*. Deberías haber recibido una invitación al calendario, incluyendo los detalles de la conexión a la videoconferencia, una invitación de Slack y la URL del documento de notas colaborativas que utilizaremos durante la formación.

source: We look forward to seeing you and please get in touch with any questions you have beforehand.
es_419: Estaremos encantados de recibirte y por favor, comunícate con anticipación si tienes alguna duda.

source: Best wishes,
es_419: Saludos cordiales,

source: *<insert instructor names here>*
es_419: *<completar con el nombre de los instructores>*

source: After sending the email, create the videoconferencing call for Part One and Part Two of the training, then share a calendar invitation with the connection details and a link to the CodiMD document.
es_419: Después de enviar el correo electrónico, crea la llamada de la videoconferencia para la Parte 1 y la Parte 2 de la formación, después comparte una invitación al calendario con los detalles de la conexión y un enlace al documento CodiMD.

source: Screenshot of setting editing rights on CodiMD to "Freely".
es_419: Captura de pantalla sobre cómo configurar los derechos de edición en CodiMD a "Gratuito".

source: Set editing rights on CodiMD to "Freely"
es_419: Establecer los derechos de edición en CodiMD a "Gratuito"

source: Allow anyone to edit the CodiMD document without signing in by clicking the dropdown in the top-right of the document in *Read Mode* and selecting "Freely".
es_419: Permite que cualquier persona pueda editar el documento CodiMD sin iniciar sesión haciendo clic en el menú desplegable que se encuentra en la parte superior derecha del documento en *Modo Lectura* y seleccionando "Gratuito".

source: Feedback collection
es_419: Recolección de comentarios

source: Screenshot of Settings > Responses > Restrict to users in 2i2c.org and its trusted organisations switched to Off.
es_419: Captura de pantalla de Settings (Configuración) > Responses (Respuestas) > Restrict to users in 2i2c.org and its trusted organisations (Restringir a los usuarios de 2i2c.org y sus organizaciones de confianza) cambiado a Off (apagado).

source: There are a number of [template Google Forms](https://drive.google.com/drive/folders/1K16xUpvuoMN9YrDiajgt3a6WF8HyYvse?usp=drive_link) available to collect feedback from your lesson. This feedback is important for iterative lesson development – during teaching, enlist your lesson helper to keep you accountable for this!
es_419: Hay un número de [plantillas de Google Forms](https://drive.google.com/drive/folders/1K16xUpvuoMN9YrDiajgt3a6WF8HyYvse?usp=drive_link) disponibles para recibir comentarios sobre tu lección. Esta retroalimentación es importante para el desarrollo de las lecciones iterativas. Durante el curso, pide a tu ayudante que se haga responsable de esto!

source: Allow access outside of your organisation
es_419: Permitir el acceso por fuera de tu organización

source: For each Google Form that you copy from the template, make sure that *Settings > Responses > Restrict to users in `2i2c.org` and its trusted organisations* is switched to *Off* (click the screenshot in the margin). This enables respondants to access to the form from outside of your organisation.
es_419: Por cada formulario de Google que copies de la plantilla, asegúrate de que la opción *Settings (Configuración) > Responses (Respuestas) > Restrict to users in 2i2c.org and its trusted organisations (Restringir a los usuarios de 2i2c.org y sus organizaciones de confianza)* cambien a *Apagado* (haz clic en la captura de pantalla que se muestra en el margen). Esto permitirá a los encuestados acceder al formulario desde fuera de tu organización.

source: **Template forms**
es_419: **Plantillas de Formularios**

source: Registration
es_419: Registro

source: Pre-Training Survey
es_419: Encuesta previa a la formación

source: Post-Training Survey
es_419: Encuesta posterior a la formación

source: Episode 1: Minute Card Feedback
es_419: Episodio 1: Comentarios de la tarjeta de un minuto

source: Episode 2: Minute Card Feedback
es_419: Episodio 2: Comentarios de la tarjeta de un minuto

source: Episode 3: Minute Card Feedback
es_419: Episodio 3: Comentarios de la tarjeta de un minuto

source: Episode 4: Minute Card Feedback
es_419: Episodio 4: Comentarios de la tarjeta de un minuto

source: Episode 5: Minute Card Feedback
es_419: Episodio 5: Comentarios de la tarjeta de un minuto

source: Episode 6: Minute Card Feedback
es_419: Episodio 6: Comentarios de la tarjeta de un minuto

source: Community Showcase Hub setup
es_419: Configuración del Hub de muestra comunitario

source: Hub Champions will need access to the 2i2c [Community Showcase Hub](https://showcase.2i2c.cloud) and hub administrator privileges to complete this training.
es_419: Los Campeones y Campeonas del Hub necesitarán acceso al [Hub de muestra comunitario](https://showcase.2i2c.cloud) y tener privilegios de administrador del hub para completar esta formación.

source: To grant access to this hub, instructors will need to add learners to this [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) and grant them Owner status. Adding members to this team requires Owner/Maintainer permissions – if you have trouble then please send an email to [support@2i2c.org](mailto:support@2i2c.org).
es_419: Para conceder acceso a este hub, los instructores tendrán que agregar estudiantes a este [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) (Equipo de GitHub) y concederles el estado de propietario. Agregar miembros a este equipo requiere permisos de Propietario/Mantenedor. Si tienes problemas, envía un correo electrónico a [support@2i2c.org](mailto:support@2i2c.org).

source: To grant administrator privileges on the hub, go to the [Community Showcase Hub home](https://showcase.2i2c.cloud/hub/home) and click the *Admin* sub-menu in the navbar. You will see a table of users who have access to the hub. Click *Edit User* of the user you would like to grant admin access to. In the next screen, check the *Admin* box and click *Apply* to grant administrator privileges.
es_419: Para conceder privilegios de administrador en el hub, ve al [home (inicio) del Hub de muestra comunitario](https://showcase.2i2c.cloud/hub/home) y haz clic en el submenú *Admin* (Administrador) en la barra de navegación. Verás una tabla de usuarios que tienen acceso al hub. Haz clic en *Edit User* (Editar usuario) en el usuario al que deseas conceder acceso de administrador. En la siguiente pantalla, marca la casilla *Admin* (Administrador) y haz clic en *Apply* (Aplicar) para conceder privilegios de administrador.

source: During the lesson, [](episode-access), Hub Champions will be asked to invite the user `jnywong-test` to the [GitHub Organization](https://github.com/2i2c-community-showcase). Please ensure this account is removed from the organization prior to the workshop. Similarly, Hub Champions will be asked to add and remove `jmunroe-testuser` from the [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase).
es_419: Durante la lección [](episode-access), se le pedirá a los Campeones y Campeonas del Hub que inviten al usuario `jnywong-test` a la [GitHub Organization](https://github.com/2i2c-community-showcase). Asegúrate de remover esta cuenta de la organización antes del taller. Del mismo modo, se le pedirá a los Campeones y Campeonas del Hub que agreguen y eliminen a `jmunroe-testuser` del [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) (Equipo de GitHub).

source: Post-workshop Tasks
es_419: Tareas posteriores al taller

source: Follow up with an email two days after the workshop to thank learners for their time and encourage them to complete the post-training survey. You may use the follow email template.
es_419: Dar seguimiento con un correo electrónico dos días después del taller para agradecer a los estudiantes por su tiempo y animarles a completar la encuesta posterior a la formación. Puedes utilizar la siguiente plantilla de correo electrónico.

source: Post-workshop email template
es_419: Plantilla para el correo posterior al taller

source: Thank you for attending the recent Hub Champion Training workshop. We hope you left your workshop with skills and knowledge needed to empower your communities to make best use out of the hub. We would like to capture your thoughts about what was covered and your perception of the workshop overall. Please complete the post-workshop survey as soon as possible.
es_419: Gracias por asistir al reciente taller de formación para los Campeones y Campeonas del Hub. Esperamos que finalices el taller con las habilidades y conocimientos necesarios para formar a tus comunidades y ayudarles a que hagan un mejor uso del hub. Nos gustaría conocer tus pensamientos sobre los temas que se abordaron y tu percepción sobre el taller en general. Te pedimos que completes la encuesta posterior al taller tan pronto como sea posible.

source: If you have any questions and would like to contact us, feel free to email us at [support@2i2c.org](mailto:support@2i2c.org). We are excited about your continued involvement with our community!
es_419: Si tienes alguna duda y deseas comunicarte con nosotros, envíanos un correo electrónico a [support@2i2c.org](mailto:support@2i2c.org). ¡Estamos emocionados por tu participación continua con nuestra comunidad!

source: Restore the Community Showcase Hub by removing the user `jnywong-test` from the [GitHub Organization](https://github.com/2i2c-community-showcase) and removing `jmunroe-testuser` from the [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase). Adjust the permissions of learners from *Owner* to *Member*.
es_419: Restaura el Hub de muestra comunitario eliminando el usuario `jnywong-test` de la [GitHub Organization](https://github.com/2i2c-community-showcase) y eliminando a `jmunroe-testuser` del [GitHub Team](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) (Equipo de GitHub). Ajusta los permisos de los estudiantes de *Owner* (Propietario) a *Member* (Miembro).

source: Remove administrator privileges on the hub by opening a [2i2c support ticket](https://docs.2i2c.org/support/) to provide the Community Showcase Hub URL (`https://showcase.2i2c.cloud`) and a list of Hub Champion GitHub usernames that require administrator status removing.
es_419: Elimina los privilegios de administrador en el hub abriendo un [ticket de soporte en 2i2c](https://docs.2i2c.org/support/) para proporcionar la URL del Hub de muestra comunitario (`https://showcase. i2c.cloud`) y una lista de nombres de usuarios de los Campeones y Campeonas del Hub en GitHub que requieren que se elimine el estado de administrador.

source: Tasklist
es_419: Lista de tareas

source: One week before the workshop
es_419: Una semana antes del taller

source: Copy the CodiMD template, remove the episode section content and set editing rights to *Freely*
es_419: Copia la plantilla CodiMD, elimina el contenido de la sección de episodios y establece los derechos de edición a *Gratuito*

source: Copy feedback form templates and check access permissions
es_419: Copia las plantillas del formulario de comentarios y revisa los permisos de acceso

source: Set up a Slack channel, or equivalent
es_419: Configura un canal de Slack, o equivalente

source: Schedule the videoconferencing calls for Part One and Part Two
es_419: Programa las llamadas de videoconferencia para la Parte 1 y la Parte 2

source: Email learners one week before the workshop
es_419: Envia un correo electrónico a los estudiantes una semana antes del taller

source: Share a calendar invitation for Part One and Part Two with links to the videoconference call, CodiMD document and Slack channel
es_419: Comparte una invitación al calendario para la Parte 1 y la Parte 2 con enlaces a la videoconferencia, el documento CodiMD y el canal Slack

source: Prepare the Community Showcase Hub
es_419: Prepara el Hub de muestra comunitario

source: Add learners to GitHub team **and** grant them Owner status
es_419: Agrega estudiantes al equipo de GitHub **y** concédeles el estado de Owner (propietario)

source: Grant *Admin* privileges to learners on the Community Showcase Hub
es_419: Concede privilegios de *Admin* (Administrador) a los estudiantes en el Hub de muestra comunitario

source: Deliver Part One
es_419: Imparte la Parte 1

source: Host Part One of the workshop
es_419: Presenta la Parte 1 del taller
