Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/instructors/instructor-notes.po
Languages: es_419

source: Remember to record the workshop so that learners can refer back to this for later viewing
es_419: Recuerda grabar el taller para que los estudiantes puedan consultarlo más tarde

source: After Part One
es_419: Después de la Parte 1

source: Populate the CodiMD for the self-guided study
es_419: Completa el CodiMD para el estudio autoguiado

source: Deliver Part Two
es_419: Imparte la Parte 2

source: Host Part Two of the workshop
es_419: Presenta la Parte 2 del taller

source: After Part Two
es_419: Después de la Parte 2

source: Email learners two days after the workshop to complete feedback and follow-up on micro-grant status (if applicable)
es_419: Envía un correo electrónico a los estudiantes dos días después del taller para que completen los formularios de comentarios y hacer el seguimiento sobre el estado de las microbecas (si aplica)

source: Restore the Community Showcase Hub
es_419: Restaura el Hub de prueba comunitario

source: Remove Owner status from the GitHub team
es_419: Elimina el estado de Owner (Propietario) del equipo de GitHub

source: Remove *Admin* privileges from learners on the Community Showcase Hub
es_419: Elimina los privilegios de *Administrador* de los estudiantes en el Hub de muestra comunitario

source: Evaluate feedback
es_419: Evalua los comentarios
