Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/access_hub.po
Languages: es_419

source: Controlling access to your hub
es_419: Control del acceso a tu hub

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: Who has control over access to a hub?
es_419: ¿Quién puede controlar el acceso a un hub?

source: How do I invite members to a GitHub Organization?
es_419: ¿Cómo puedo invitar personas a una organización de GitHub (GitHub Organization)?

source: How do I grant access to a hub with GitHub Teams?
es_419: ¿Cómo concedo acceso a un hub con equipos de GitHub (GitHub Teams)?

source: **Objectives**
es_419: **Objetivos**

source: Control user access to a hub via GitHub Organizations and Teams
es_419: Controlar el acceso de las personas al hub mediante GitHub Organizations y GitHub Teams

source: Add users to a GitHub Organization
es_419: Agregar usuarios a una organización de GitHub

source: Add and remove users from a GitHub Team to grant access to a hub
es_419: Agregar y eliminar usuarios de un GitHub Team para permitir el acceso a un hub

source: Who decides which users can access a hub?
es_419: ¿Quién decide qué personas pueden acceder a un hub?

source: Hub Champions can control access to the hub by adding users to their {ref}`GitHub Organization <glossary:github-org>`. Hub Champions can add users to a {ref}`GitHub Team<glossary:github-team>` within an Organization for more fine-grained control over access. Each hub user needs to [sign up](https://github.com/signup) for an individual account on GitHub. A Hub Champion should have Owner permissions for their GitHub Organization in order to invite non-members to it.
es_419: Los Campeones y Campeonas del Hub pueden controlar el acceso al hub al agregar usuarios a su {ref}`GitHub Organization <glossary:github-org>`. Los Campeones y Campeonas del Hub pueden agregar usuarios a un {ref}`GitHub Team<glossary:github-team>` dentro de una GitHub Organization para obtener un control más detallado sobre el acceso. Cada usuario/a del hub debe [registrarse](https://github.com/signup) para obtener una cuenta individual en GitHub. Un Campeón o Campeona del Hub debe tener permisos de propietario para su organización de GitHub para poder invitar a personas que no sean miembros.

source: Your GitHub Organization or Team used to authorize access to the hub was defined when the hub was initially deployed. This information should be known to Hub Champions and can also be found in the [2i2c Infrastructure repo](https://github.com/2i2c-org/infrastructure) (e.g. see the key value for `allowed_organizations` in the [`values.yaml` file of the BHKI hub](https://github.com/2i2c-org/infrastructure/blob/main/config/clusters/catalystproject-africa/bhki.values.yaml)). If not, please contact your community representative who deployed the hub.
es_419: La GitHub Organization o el GitHub Team que se utilizan para autorizar el acceso al hub fue definido cuando el hub se implementó. Esta información debe ser conocida por los Campeones y Campeonas del Hub, y también puede encontrarse en el [Repositorio de la infraestructura de 2i2c](https://github.com/2i2c-org/infrastructure) (por ejemplo, revisa el valor clave para `allowed_organizations` en el archivo [`values.yaml` del hub BHKI](https://github.com/2i2c-org/infrastructure/blob/main/config/clusters/catalystproject-africa/bhki.values.yaml)). De lo contrario, comunícate con el representante de la comunidad que implementó tu hub.

source: Follow the guidance below to practise granting user access to the [Community Showcase Hub](https://showcase.2i2c.cloud/), specifically
es_419: Consulta la siguiente guía para practicar cómo conceder acceso al [Hub de muestra comunitario](https://showcase.2i2c.cloud/), específicamente

source: adding (but *not* removing for now) users to a GitHub Organization
es_419: agregando (pero *no* eliminando por el momento) usuarios a una GitHub Organization

source: adding and removing users to and from a GitHub Team.
es_419: agregando y eliminando usuarios de un GitHub Team.

source: Please refrain from removing other users from the GitHub Organization during the training! The steps in {ref}`Removing members from the organization <org-remove>` are for completeness when it comes to administering your own hub outside of the training.
es_419: ¡Por favor, evita eliminar a otros usuarios de la organización de GitHub durante la formación! Los pasos que se encuentran en {ref}`Quitar miembros de la organización <org-remove>` son para completarse cuando se trata de administrar tu propio hub, fuera de la formación.

source: Managing your GitHub Organization
es_419: Administración de tu GitHub Organization

source: View a list of all of the GitHub Organizations that you are a member of by visiting [https://github.com/settings/organizations](https://github.com/settings/organizations).
es_419: Ve una lista de todas las GitHub Organization de las que eres miembro en el enlace [https://github.com/settings/organizations](https://github.com/settings/organizations).

source: Screenshot showing a list of GitHub Organizations on https://github.com/settings/organizations.
es_419: Captura de pantalla donde se muestra una lista de GitHub Organizations en https://github.com/settings/organizations.

source: Screenshot showing an example list of GitHub Organizations on [https://github.com/settings/organizations](https://github.com/settings/organizations).
es_419: Captura de pantalla donde se muestra una lista de ejemplos de GitHub Organizations en [https://github.com/settings/organizations](https://github.com/settings/organizations).

source: Click on the link to the [2i2c-community-showcase](https://github.com/2i2c-community-showcase) GitHub Organization (if you cannot access the page at this link then please contact your instructor for access).
es_419: Haz clic en el enlace a la GitHub Organization [2i2c-community-showcase](https://github.com/2i2c-community-showcase) (si no puedes acceder a la página mediante este enlace, comunícate con tu instructor para obtener acceso).

source: Click on the *People* menu tab to view a list of current Organization members.
es_419: Haz clic en la pestaña del menú *People* (Personas) para ver una lista de los miembros actuales de la GitHub Organization.

source: Screenshot showing a list of members of the 2i2c-community-showcase GitHub Organization.
es_419: Captura de pantalla donde se muestra una lista de miembros de la GitHub Organization 2i2c-community-showcase.

source: Screenshot showing a list of [2i2c-community-showcase](https://github.com/orgs/2i2c-community-showcase/people) GitHub Organization members. The *People* tab menu is located at the top; the green *Invite member* button is located in the top right; the *Failed invitations* tab is located in the left sidebar and the *Member settings* ![member settings button](../media/episodes/administer_hub/gh-org-3.png) icon is located next to each member account.
es_419: Captura de pantalla donde se muestra una lista de los miembros de la GitHub Organization [2i2c-community-showcase](https://github.com/orgs/2i2c-community-showcase/people). El menú *People* se encuentra en la parte superior, el botón verde *Invite member* (invitar miembro) se encuentra en la parte superior derecha, la pestaña *Failed invitations* (Invitaciones fallidas) se encuentra en la barra lateral izquierda y el ícono *Member settings* (Configuración de los miembros) ![member settings button](../media/episodes/administer_hub/gh-org-3.png) se encuentra junto a la cuenta de cada miembro.

source: member settings button
es_419: botón de configuración de los miembros

source: Exercise: Invite non-members to the organization
es_419: Ejercicio: Invitar a la GitHub Organization a personas que no son miembros

source: Check that you have *Owner* permissions for this organization to invite non-members to it. If not, contact an owner of the organization who can give you *Owner* permissions.
es_419: Comprueba que tienes *Owner permissions* (permisos de propietario) para que esta organización pueda invitar a personas que no son miembros. De lo contrario, comunícate con un propietario de la GitHub Organization que pueda darte permisos de propietario.

source: Invite a non-member to the organization by clicking the green *Invite member* button and searching by username, full name or email address.
es_419: Invita a la GitHub Organization a una persona que no sea miembro haciendo clic en el botón verde *Invite member* (Invitar miembro) y búscala por nombre de usuario, nombre completo o dirección de correo electrónico.

source: We recommend searching for and adding the `jnywong-test` username for the purposes of this training. Since this account may receive multiple invitations during this workshop, you can click a green **Update invitation** button instead.
es_419: Recomendamos que busques y agregues el nombre de usuario `jnywong-test` como práctica en este entrenamiento. Dado que esta cuenta puede recibir varias invitaciones durante este taller, también puedes hacer clic en el botón verde **Update invitation** (Actualizar invitación).

source: The invited user will receive an email and GitHub notification inviting them to join the GitHub Organization.
es_419: Las personas invitadas recibirán un correo electrónico y notificaciones de GitHub en las que se le invita a unirse a la GitHub Organization.

source: Invitations to join a GitHub Organization will expire after 7 days, after which you can retry or cancel the invitation by clicking the *Failed invitations* tab in the left sidebar (see screenshot above).
es_419: Las invitaciones para unirse a una GitHub Organization expirarán después de 7 días, después de lo cual puedes reintentar o cancelar la invitación haciendo clic en la pestaña *Failed invitations* (Invitaciones fallidas) que se encuentra en la barra lateral izquierda (ver la captura de pantalla que se encuentra arriba).

source: Once the user has accepted, they will become visible in the list of Organization members in the *People* menu tab.
es_419: Una vez que la persona haya aceptado, será visible en la lista de miembros de la GitHub Organization, en la pestaña del menú *People* (Personas).

source: Removing members from the organization
es_419: Eliminar miembros de la GitHub Organization

source: Please refrain from removing other users from the GitHub Organization during the training! The steps in this section are for completeness when it comes to administering your own hub outside of the training.
es_419: ¡Evita eliminar a otras personas de la GitHub Organization durante la formación! Los pasos que se encuentran en esta sección son para completarse cuando se trata de administrar tu propio hub fuera de la formación.

source: Members can be removed from the organization by going to the *People* menu tab (see {ref}`screenshot <gh-org-people>`).
es_419: Los miembros pueden ser eliminados de la organización en la pestaña del menú *Personas* (ver la {ref}`captura de pantalla <gh-org-people>`).

source: Click the ![member settings button](../media/episodes/administer_hub/gh-org-3.png) icon next to the member account you wish to remove.
es_419: Haz clic en el ícono ![member settings button](../media/episodes/administer_hub/gh-org-3.png) que se encuentra junto a la cuenta del miembro que deseas eliminar.

source: Select the *Remove from organization...* option.
es_419: Selecciona la opción *Remove from organization...* (Eliminar de la organización...).

source: Screenshot showing the *Remove from organization...* option.
es_419: Captura de pantalla donde se muestra la opción *Remove from organization...* (Eliminar de la organización...)*.

source: Confirm removal by clicking the *Remove members* button.
es_419: Confirma la eliminación haciendo clic en el botón *Remove members* (Eliminar miembros).

source: Screenshot showing the confirmation to *Remove members*.
es_419: Captura de pantalla donde se muestra la confirmación de la opción *Remove members* (Eliminar miembros).

source: Managing your GitHub Team
es_419: Administrar tu GitHub Team

source: Add members to the GitHub Team associated with the hub so that users can log into the hub with their GitHub credentials.
es_419: Agrega miembros al GitHub Team asociado con el hub para que los usuarios puedan iniciar sesión en el hub con sus credenciales de GitHub.

source: From the 2i2c-community-showcase [GitHub Organization page](https://github.com/2i2c-community-showcase/), click on the *Teams* menu tab.
es_419: En la página 2i2c-community-showcase [Página de la GitHub Organization](https://github.com/2i2c-community-showcase/), haz clic en la pestaña del menú *Teams* (Equipos).

source: The GitHub Team that authorises access to the Community Showcase Hub is called [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase). Click on it to see a list of members.
es_419: El GitHub Team que autoriza el acceso al Hub de muestra comunitario de 2i2c se llama [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase). Haz clic en el enlace para ver una lista de los miembros.

source: Screenshot showing a list of members of the access-2i2c-showcase GitHub Team.
es_419: Captura de pantalla donde se muestra una lista de los miembros del GitHub Team access-2i2c-showcase.

source: Screenshot showing a list of [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) GitHub Team members.
es_419: Captura de pantalla donde se muestra una lista de los miembros del GitHub Team [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase).

source: Exercise: Add a member of the organization to join the team
es_419: Ejercicio: Agrega un miembro de la GitHub Organization para unirlo al GitHub Team

source: Invite a member of the organization to join the team by clicking the green *Add a member* button and searching by username, full name or email address.
es_419: Invita a un miembro de la GitHub Organization a unirse al GitHub Team haciendo clic en el botón verde *Add a member* (Agregar un miembro) y buscándolo por nombre de usuario, nombre completo o dirección de correo electrónico.

source: We recommend searching for and adding the `jmunroe-testuser` username for the purposes of this training. If they are already a member of the team, remove the account by following the steps in {ref}`Removing members from the team<team-remove>` and then add `jmunroe-testuser` back into the team again.
es_419: Recomendamos que busques y agregues el nombre de usuario `jmunroe-testuser` como práctica en este entrenamiento. Si ya es miembro del equipo, elimina la cuenta siguiendo los pasos que se describen en {ref}`Eliminar miembros del equipo<team-remove>` y después agrega nuevamente a `jmunroe-testuser` al GitHub Team.

source: The account will instantly appear in the list of team members and the user does not need to accept an invitation to join. The user may choose to leave the team by clicking the ![Leave team](../media/episodes/administer_hub/gh-team-2.png) button on the same page.
es_419: La cuenta se mostrará inmediatamente en la lista de miembros del GitHub Team y el usuario no tendrá que aceptar una invitación para unirse. El usuario puede abandonar el equipo haciendo clic en el botón ![Leave team](../media/episodes/administer_hub/gh-team-2.png) que se encuentra en la misma página.

source: Leave team
es_419: Salir de un GitHub Team

source: The user can now log into the [Community Showcase Hub](https://showcase.2i2c.cloud) using their GitHub credentials 🎉
es_419: Ahora el usuario puede iniciar sesión en el [Hub de muestra comunitario de 2i2c](https://showcase.2i2c.cloud) utilizando sus credenciales de GitHub 🎉

source: Removing members from the team
es_419: Eliminar miembros del GitHub Team

source: Hub Champions can remove user access to a hub by removing their account from the GitHub Team.
es_419: Los Campeones y Campeonas del Hub pueden eliminar el acceso de un usuario del hub si eliminan su cuenta del GitHub Team.

source: Screenshot showing how to remove a member from the access-2i2c-showcase GitHub Team.
es_419: Captura de pantalla donde se muestra cómo eliminar un miembro del GitHub Team access-2i2c-showcase.

source: Screenshot showing how to remove a member from the [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) GitHub Team.
es_419: Captura de pantalla donde se muestra cómo eliminar a un miembro del GitHub Team [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase).

source: From the [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase) teams page, check the box next to the member account you wish to remove (in this case, `jmunroe-testuser` for the purposes of this training).
es_419: Desde la página del GitHub Team [access-2i2c-showcase](https://github.com/orgs/2i2c-community-showcase/teams/access-2i2c-showcase), marca la casilla que se encuentra junto a la cuenta del miembro que deseas eliminar (en este caso, `jmunroe-testuser` como práctica en este entrenamiento).

source: Click the tab at the top of the list labelled *1 member selected*.
es_419: Haz clic en la pestaña que se encuentra en la parte superior de la lista etiquetada *1 member selected* (1 miembro seleccionado).

source: Select *Remove from team* from the dropdown menu.
es_419: Selecciona la opción *Remove from team* (Eliminar del equipo) en el menú desplegable.

source: Confirm your choice in the pop up by clicking *Remove members*.
es_419: Confirma tu elección en la ventana emergente haciendo clic en *Remove members* (Eliminar miembros).

source: The account will instantly disappear in the list of team members and the user will not be notified.
es_419: La cuenta desaparecerá instantáneamente de la lista de miembros del GitHub Team y el usuario no será notificado.

source: Exercise: GitHub Organizations and Teams
es_419: Ejercicio: GitHub Organizations y GitHub Teams

source: Fill in the blanks with the following words: *organization, team, owners, non-members, existing members* (you may use one word more than once).
es_419: Completa los espacios en blanco con las siguientes palabras: *organización, equipo, propietarios, no miembros, miembros existentes* (puedes usar una palabra más de una vez).

source: "___s are groups of ___ members that reflect your group's structure and controls access permissions. ___ have permission to invite ___ to the organisation and invite ___ of the organization to a ___."
es_419: "Los ___s son grupos de miembros de la ___ que reflejan la estructura de su grupo y controlan los permisos de acceso. Los ___ tienen permiso para invitar a personas que ___ a la organización e invitar a los ___ de la organización a un ___".

source: Solution
es_419: Solución

source: "**Team**s are groups of **organization** members that reflect your group's structure and controls access permissions. **Owners** have permission to invite **non-members** to the organization and invite **existing members** of the organization to a **team**."
es_419: "Los **equipo**s son grupos de miembros de la **organización** que reflejan la estructura de su grupo y controlan los permisos de acceso. Los **propietarios** tienen permiso para invitar a personas que **no son miembros** a la organización e invitar a los **miembros existentes** de la organización a un **equipo**".

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: A Hub Champion decides who has access to the hub.
es_419: Un Campeón o Campeona del Hub decide quién tiene acceso al hub.

source: Hub access is controlled with GitHub Organizations and Teams.
es_419: El acceso al hub es controlado mediante GitHub Organizations y GitHub Teams.

source: Owners of GitHub Organizations can invite users to it, as well as add and remove users to and from a special GitHub Team to grant access.
es_419: Los propietarios (owners) de las GitHub Organizations pueden invitar a usuarios, así como agregarlos y eliminarlos de GitHub Teams especiales para concederles acceso.
