Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/introduction.po
Languages: es_419

source: Recognising the benefits your hub can provide for your user community
es_419: Conoce los beneficios que tu hub puede proporcionar a tu comunidad de usuarios y usuarias

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: What is interactive computing in the cloud?
es_419: ¿Qué es la computación interactiva en la nube?

source: How can interactive computing in the cloud serve hub communities in research and/or education?
es_419: ¿Cómo puede la computación interactiva en la nube servir a las comunidades del hub con respecto a investigación y/o educación?

source: What is the role of a Hub Champion?
es_419: ¿Cuál es el papel de un Campeón o Campeona del Hub?

source: **Objectives**
es_419: **Objetivos**

source: Identify the benefits provided by a hub for interactive cloud computing
es_419: Identificar los beneficios que proporciona un hub para la computación interactiva en la nube

source: Recognise use cases for interactive cloud computing in a Hub Champion's user community
es_419: Reconocer los casos de uso de la computación interactiva en la nube para la comunidad de usuarios de Campeones y Campeonas del Hub

source: Describe their role and capacity as a Hub Champion to administer and support their hub
es_419: Describir su rol y capacidad como Campeón o Campeona del Hub para administrar y apoyar a su hub

source: Introduction
es_419: Introducción

source: This episode introduces the concept of a hub for interactive cloud computing and how a hub in the cloud can benefit the user communities a hub champion supports.
es_419: En este episodio se presenta el concepto de un hub para la computación interactiva en la nube, y cómo éste puede beneficiar a las comunidades de usuarios a las que apoya un Campeón o Campeona del Hub.

source: How can interactive computing in the cloud benefit my community?
es_419: ¿Cómo puede la computación interactiva en la nube beneficiar a mi comunidad?

source: Interactive computing is a fundamental way in which researchers and educators use a computer program to perform tasks that include (but are not limited to)
es_419: La computación interactiva es un método esencial en la que quienes investigan y educan utilizan un programa informático para llevar a cabo tareas que incluyen (pero no se limitan a)

source: generating data from experiments or simulations, or gathering data from secondary sources
es_419: generar datos a partir de experimentos o simulaciones, o recopilar datos de fuentes secundarias

source: processing and analysing data using statistical techniques and algorithms
es_419: procesar y analizar datos utilizando técnicas y algoritmos estadísticos

source: developing data-driven and/or mechanistic predictive models
es_419: desarrollar modelos predictivos mecanístico y/o impulsados por datos

source: visualising results to graphically reveal insights.
es_419: visualizar los resultados para revelar gráficamente ideas.

source: Real-time interactivity helps information flow back and forth between the user and their work, creating a dynamic and productive environment for research and educational activity. Project Jupyter is an ecosystem of open-source tools that can provide a web-based interactive computational environment, in the form of "notebooks", for several languages, namely **Ju**lia, **Py**thon and **R** (hence the name Project **Jupy**te**r**).
es_419: La interactividad en tiempo real ayuda a que la información fluya entre la persona y su trabajo, creando un entorno dinámico y productivo para la investigación y la actividad educativa. El Proyecto Jupyter es un ecosistema de herramientas de código abierto que puede proporcionar un entorno computacional interactivo basado en la web en forma de "notebooks", para varios idiomas, por ejemplo, **Ju**lia, **Py**thon y **R** (de ahí el nombre del proyecto **Jupy**te**r**).

source: Cartoon depicting common interactive computing use cases such as data collection, data processing and analysis, predictive modelling and data visualization.
es_419: Dibujo que representa casos comunes de computación interactiva como la recopilación de datos, el procesamiento y análisis de datos, los modelos predictivos y la visualización de datos.

source: With the advent of "big data", many researchers and educators encounter limitations with using traditional methods for handling data on a local machine or laptop. The size and number of datasets prevalent in disciplines such as genomics, meteorology, healthcare, and environmental sciences, to name a few, are growing at an exponential rate, and consequently, the need for large-scale infrastructure to support continually intensive computational workflows also grows.
es_419: Con la llegada del "big data", muchas personas que investigan y educan se enfrentan a limitaciones en el uso de métodos tradicionales para manejar datos en una computadora portátil o máquina local. El tamaño y el número de los conjuntos de datos prevalentes en disciplinas como genómica, meteorología, salud y ciencias ambientales, por mencionar algunas, están creciendo a un ritmo exponencial y, por lo tanto, también aumenta la necesidad de tener una infraestructura a gran escala para apoyar los flujos de trabajo computacionales continuamente intensivos.

source: Cloud computing icon.
es_419: Icono de computación en la nube.

source: Cloud computing is one way of provisioning the system resources needed to meet this demand. This relies on the sharing of on-demand services usually provided by commercial entities such as AWS, Google Cloud and Microsoft Azure. Academics in research and education are often limited in their capacity to sustainably administrate cloud infrastructure at scale and may also wish to support open-source tools and vendor-agnostic infrastructure to protect scientific reproducibility and encourage effective collaboration.
es_419: La computación en la nube es una forma de proporcionar los recursos necesarios al sistema para satisfacer esta demanda. Esto se basa en el uso compartido de los servicios "on-demand", normalmente proporcionados por entidades comerciales como AWS, Google Cloud y Microsoft Azure. Quienes investigan y educan en la academia a menudo son limitados en su capacidad para administrar de forma sostenible la infraestructura en la nube a escala, y también tal vez quieran apoyar herramientas de código abierto e infraestructura de proveedores para proteger la reproducibilidad científica y fomentar una colaboración eficaz.

source: This is where a non-profit initiative such as [2i2c](https://2i2c.org/) can help. 2i2c specialises in managing open Jupyter architecture in the cloud specially designed for communities of practice in research and education using open-source tools that allow them to reproduce environments, code and data on different machines. Users can access large-scale compute and storage as needed and workflows are entirely reproducible and supported by using community-driven, open-source technologies.
es_419: Aquí es donde una iniciativa sin fines de lucro como [2i2c](https://2i2c.org/) puede ayudar. 2i2c se especializa en administrar la arquitectura abierta de Jupyter en la nube, diseñada especialmente para comunidades de práctica en investigación y educación, utilizando herramientas de código abierto que les permiten reproducir entornos, código y datos en diferentes máquinas. Las personas pueden acceder a las computadoras y al almacenamiento a gran escala según sea necesario y los flujos de trabajo son totalmente reproducibles y apoyados gracias a las tecnologías de código abierto impulsadas por la comunidad.

source: JupyterHubs in the Cloud
es_419: JupyterHubs en la nube

source: In this lesson, our definition of the word *hub* refers to a {ref}`JupyterHub <glossary:jupyterhub>` that is hosted on cloud infrastructure and managed by [2i2c](https://2i2c.org/).
es_419: En esta lección, nuestra definición de la palabra *hub* se refiere a un {ref}`JupyterHub <glossary:jupyterhub>` que está alojado en la infraestructura en la nube y administrado por [2i2c](https://2i2c.org/).

source: Diagram showing an overview of a 2i2c hub, including authentication, online content, custom environments, the community hub, cloud infrastructure, support and services.
es_419: Diagrama que muestra una visión general de un hub de 2i2c, el cual incluye autenticación, contenido en línea, entornos personalizados, el hub de la comunidad, infraestructura en la nube, soporte y servicios.

source: Community Hub
es_419: Hub de la comunidad

source: A hub provides an access point to interactive computing in the cloud for a user community. Access to the hub is via a URL of the following form
es_419: Un hub proporciona un punto de acceso a la computación interactiva en la nube para una comunidad de usuarios. El acceso al hub es mediante una URL del siguiente formulario

source: and the landing page contains a *Log in to continue* button (see example screenshot)
es_419: y la página de destino incluye el botón *Iniciar sesión para continuar* (ver la captura de pantalla)

source: Screenshot of a hub landing page with a 'Log in to continue' button.
es_419: Captura de pantalla de una página de inicio de un hub con el botón "Iniciar sesión para continuar'".

source: Authentication
es_419: Autenticación

source: Access to the hub is controlled by Hub Champions and granted by adding a user's GitHub account to a special GitHub Team associated with the hub. A permitted user enters their GitHub credentials to log into the hub (see example screenshot)
es_419: El acceso al hub es controlado y permitido por los Campeones y Campeonas del Hub al agregar la cuenta de GitHub de una persona a un "GitHub Team" asociado al hub. La persona permitida introduce sus credenciales de GitHub para iniciar sesión en el hub (ver la captura de pantalla)

source: Screenshot of the authentication page using GitHub credentials
es_419: Captura de pantalla de la página de autenticación utilizando las credenciales de GitHub

source: Custom environments
es_419: Entornos personalizados

source: Users can choose from several machine types with varying numbers of CPU cores and RAM available, and select their desired software environment using images.
es_419: Las personas pueden elegir entre varios tipos de máquinas con diferentes números de núcleos de CPU y RAM disponibles, y seleccionar el entorno de software que desean utilizando imágenes.

source: Screenshot of server options available include Shared Small 1-4 CPU, 8-32 GB RAM, Small 4 CPU, 32 GB RAM, Medium 16 CPU, 128 GB RAM and Large 64 CPU, 512 GB RAM.
es_419: La captura de pantalla de las opciones del servidor disponibles incluyen las CPU compartidas, pequeña de 1-4, 8-32 GB RAM, pequeña de 4 CPU, 32 GB RAM, mediana 16 CPU, 128 GB RAM y grande de 64 CPU, 512 GB RAM.

source: Images available by default include
es_419: Las imágenes disponibles de manera predeterminada incluyen

source: Handbook Authoring (JupyterLab user interface) – installed Python packages include `jupyter-book, jupyterlab_myst, ghp-import, numpy, matplotlib`
es_419: Handbook Authoring (interfaz de usuario de JupyterLab) - Los paquetes de Python instalados incluyen `jupyter-book, jupyterlab_myst, ghp-import, numpy, matplotlib`

source: [Jupyter DataScience](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html#jupyter-datascience-notebook) (JupyterLab user interface) – installed Python packages include `dask, h5py, pandas, scikit-learn, scipy, sympy`
es_419: [Jupyter DataScience](https://jupyter-docker-stacks.readthedocs.io/es/latest/using/selecting.html#jupyter-datascience-notebook) (Interfaz de usuario de JupyterLab) - Los paquetes de Python instalados incluyen `dask, h5py, pandas, scikit-learn, scipy, sympy`

source: [Rocker Geospatial](https://rocker-project.org/images/versioned/rstudio.html) (RStudio user interface) – installed R packages include `ncdf4, proj4, raster, rgdal, rgeos, sf, sp`
es_419: [Rocker Geospatial](https://rocker-project.org/images/versioned/rstudio.html) (Interfaz de usuario de RStudio) - Los paquetes de R instalados incluyen `ncdf4, proj4, raster, rgdal, rgeos, sf, sp`

source: Other... – specify a custom JupyterLab/RStudio image
es_419: Otra... - Especificar una imagen personalizada de JupyterLab/RStudio

source: Online Content
es_419: Contenido en línea

source: There are many ways to manage online content on the hub. For example
es_419: Hay muchas maneras de administrar el contenido en línea en el hub. Por ejemplo

source: users have access to their own filesystem and a home directory of up to 10 GB
es_419: cada persona tiene acceso a su propio sistema de archivos y a un directorio principal de hasta 10 GB

source: Hub Champions can distribute data to all hub users in a shared directory
es_419: los Campeones y Campeonas del Hub pueden distribuir los datos a todos las personas del hub que estén en un directorio compartido

source: users can securely pull and push code to and from the hub using GitHub.
es_419: las personas pueden recibir (pull) y enviar código (push) de forma segura desde y hacia el hub mediante GitHub.

source: Cloud infrastructure
es_419: Infraestructura en la nube

source: Hubs are deployed on AWS, Google Cloud or Microsoft Azure commercial cloud providers. Code for 2i2c hub configuration and deployment follows best practices and is open and transparent to all. 2i2c hubs are designed with the [Right to Replicate](https://2i2c.org/right-to-replicate/) by anybody on their own cloud infrastructure.
es_419: Los hubs están implementados en los proveedores comerciales en la nube de AWS, Google Cloud o Microsoft Azure. El código para la configuración e implementación de 2i2c sigue las prácticas recomendadas y es abierto y transparente para todos. Los hubs 2i2c están diseñados con el "Derecho a Replicar" [(Right to Replicate)](https://2i2c.org/right-to-replicate/) por cualquiera en su propia infraestructura en la nube.

source: Support and Services
es_419: Soporte y servicios

source: 2i2c provides dedicated operations support for the hub, such as
es_419: 2i2c proporciona soporte para operaciones dedicadas al hub, tales como

source: continuously monitoring the infrastructure
es_419: monitoreo continuo de la infraestructura

source: responding to incidents
es_419: respuesta a incidentes

source: deploying hub environments
es_419: implementación de entornos en el hub

source: upstreaming open-source developments
es_419: desarrollando código abierto que regresa a upstream

source: operating Kubernetes clusters.
es_419: operaciones con clusters de Kubernetes.

source: Hub Champions are the first point of contact for their user community to provide support and guide users to make the best use of the hub. Hub Champions may then represent and escalate support requests to 2i2c for more technical issues.
es_419: Los Campeones y Campeonas del Hub son el primer punto de contacto para su comunidad de usuarios, el cual proporciona soporte y guía a los usuarios para hacer el mejor uso del hub. Entonces, los Campeones y Campeonas del Hub pueden representar y escalar las solicitudes de soporte a 2i2c para resolver problemas más técnicos.

source: Which of the following statements are True/False?
es_419: ¿Cuáles de las siguientes afirmaciones son verdaderas/falsas?

source: a. 2i2c-managed hubs are only available via a single cloud provider. b. A hub can be accessed and used by anyone who knows its URL. c. Software environments are inflexible and irreproducible. d. 2i2c provides operations support for your hub.
es_419: a. Los hubs administrados por 2i2c solo están disponibles mediante un único proveedor en la nube. b. Cualquier persona que conozca su URL puede acceder y utilizar el hub. c. Los entornos de software son inflexibles e irreproducibles. d. 2i2c proporciona soporte a las operaciones para su hub.

source: Solution
es_419: Solución

source: a. False – Hubs are built entirely with open-source and community-driven tooling. The Right to Replicate gives communities the right to replicate their infrastructure in its entirety elsewhere. b. False – Hub Champions can control who can access the hub through GitHub or other authentication methods. c. False – Software environments are managed by Hub Champions and automatically deployed with containerisation, allowing for scalability across the cloud and reproducible user environments. d. True – 2i2c engineers maintain service availability, uptime and operational upgrades. Hub Champions are responsible for hub configuration and management to support their user community.
es_419: a. Falso - Los hubs se construyen totalmente con herramientas de código abierto e impulsadas por comunidades. El "derecho a replicar" (Right to Replicate), concede a las comunidades el derecho a replicar completamente su infraestructura en cualquier otra parte b. Falso - Los Campeones y Campeonas del Hub pueden controlar quién puede acceder al hub mediante GitHub u otros métodos de autenticación. c. Falso - Los entornos de software son administrados por los Campeones y Campeonas del Hub y se despliegan automáticamente mediante contenedores, permitiendo la escalabilidad en la nube y entornos de usuario reproducibles. d. Verdadero - Los ingenieros de 2i2c mantienen la disponibilidad del servicio y las mejoras operativas. Los Campeones y Campeonas del Hub son responsables de la configuración y administración del hub para apoyar a su comunidad.

source: Define success for your user community
es_419: Define el éxito para tu comunidad

source: As a Hub Champion, your main goal is to empower your community to make the best use of the Hub service. You represent the interests of your community and are familiar with their computational workflows and data needs.
es_419: Como Campeón o Campeona del Hub, tu objetivo principal es capacitar a tu comunidad para que utilice mejor los servicios del hub. Tú representas los intereses de tu comunidad y estás familiarizado con sus flujos de trabajo computacionales y necesidades de datos.

source: To ensure that the hub serves the interests of your community, Hub Champions may perform common administrative tasks such as
es_419: Para garantizar que el hub sirva a los intereses de su comunidad, los Campeones y Campeonas del Hub pueden llevar a cabo tareas administrativas comunes como:

source: controlling user access policy to the hub
es_419: controlar la política de acceso al hub

source: stopping and restarting servers for users
es_419: detener y reiniciar los servidores para los usuarios

source: guiding users to selecting the appropriate server options and images for their use case
es_419: guiar a los usuarios para que seleccionen las opciones apropiadas del servidor y las imágenes para su caso de uso

source: transferring and distributing data on the hub
es_419: transferir y distribuir los datos en el hub

source: representing and escalating support requests to 2i2c for technical issues
es_419: representar y escalar solicitudes de soporte a 2i2c para resolver problemas técnicos

source: facilitate knowledge transfer within the community, e.g. training events, documentation, and communication channels
es_419: facilitar la transferencia de conocimientos dentro de la comunidad, por ejemplo, eventos de capacitación, documentación y canales de comunicación

source: Exercise: What are the needs of your user community?
es_419: Ejercicio: ¿Cuáles son las necesidades de tu comunidad?

source: Let us take some time to reflect and assess the needs of your user community.
es_419: Dediquemos un tiempo para reflexionar y evaluar las necesidades de tu comunidad.

source: In pairs, discuss and share the following points:
es_419: En parejas, discutan y compartan los siguientes puntos:

source: What domain of expertise does your community have?
es_419: ¿Qué áreas del conocimiento tiene tu comunidad?

source: How large is your community? Do they work alone or do they need to collaborate together?
es_419: ¿Qué tan grande es tu comunidad? ¿Trabajan individualmente o necesitan colaborar?

source: Does your community work with large datasets?
es_419: ¿Tu comunidad trabaja con grandes conjuntos de datos?

source: Does your community need access to intensive computational power?
es_419: ¿Tu comunidad necesita acceso a un poder computacional intensivo?

source: Where applicable, are the needs for collaboration, large datasets, and/or computational power consistent across your whole community?
es_419: En los casos que aplique, ¿Las necesidades de colaboración, grandes conjuntos de datos y/o poder computacional son consistentes para toda tu comunidad?

source: What are the main software applications your community uses to conduct their work?
es_419: ¿Cuáles son las principales aplicaciones de software que tu comunidad utiliza para llevar a cabo su trabajo?

source: How familiar is your user community with version control using git/GitHub?
es_419: ¿Qué tan familiarizada está tu comunidad con el control de versiones usando git/GitHub?

source: How can a hub address the challenges your community faces?
es_419: ¿Cómo puede un hub resolver los desafíos que enfrenta tu comunidad?

source: Prepare to summarise and share with the rest of the workshop.
es_419: Prepárate para hacer un resumen y compartirlo con el resto del taller.

source: Exercise: In which of the following ways should a Hub Champion support their users?
es_419: Ejercicio: ¿En cuál de las siguientes formas debe un Campeón o Campeona del Hub apoyar a su comunidad?

source: a. Providing community guidance on best research software practices for users of your hub. b. Troubleshooting and supporting common user issues. c. Communicating infrastructure level requests and incidents to 2i2c. d. Overseeing user access policy to the hub.
es_419: a. Proporcionar orientación a la comunidad sobre las prácticas recomendadas en investigación con software para las personas usuarias del hub. b. Solucionar problemas y brindar apoyo a problemas comunes. c. Comunicar solicitudes e incidentes a nivel de infraestructura a 2i2c. d. Supervisar la política de acceso al hub.

source: All of the above are things a Hub Champion should do to enable their community to make the best use of a hub.
es_419: Todo lo anterior son cosas que un Campeón o Campeona del Hub debe hacer para que su comunidad haga un mejor uso del hub.

source: Next Steps
es_419: Próximos pasos

source: The next part of the training is a self-guided study of the following episodes
es_419: La siguiente parte de la capacitación es un estudio autoguiado de los siguientes episodios

source: and concludes with a synchronous session covering the episode {ref}`episode-troubleshoot`.
es_419: y concluye con una sesión sincrónica que cubre el episodio {ref}`episode-troubleshoot`.

source: To complete the self-study portion of the workshop, you will need to be able to access the [2i2c Community Showcase Hub](https://showcase.2i2c.cloud). When working through the self-study sections of the workshop, write your answers to the exercises in our collaborative note-taking document.
es_419: Para completar la parte autoguiada del taller, debes ser capaz de acceder al [Hub de muestra comunitario de 2i2c](https://showcase.2i2c.cloud). Cuando trabajes en las secciones autoguiadas del taller, escribe tus respuestas a los ejercicios en nuestro documento de notas colaborativas.

source: If you cannot access the hub, please contact the training instructor.
es_419: Si no puedes acceder al hub, comunícate con el instructor de la formación.

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: A hub is a 2i2c-managed JupyterHub in the cloud that provides an interactive computing service to users
es_419: Un hub es un JupyterHub en la nube administrado por 2i2c que proporciona un servicio de computación interactiva
