Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/introduction.po
Languages: es_419

source: Hub Champions empower hub users to make the best use of the service and are the first point of contact for user support
es_419: Los Campeones y Campeonas del Hub impulsan a la comunidad para que utilicen mejor los servicios y son el primer punto de contacto para brindar soporte al usuario

source: Hub Champions may perform common administrative tasks and configure the hub to set their community up for success
es_419: Los Campeones y Campeonas del Hub pueden llevar a cabo tareas administrativas comunes y configurar el hub para preparar a su comunidad para el éxito
