Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/manage_images.po
Languages: es_419

source: Managing Software Images
es_419: Administración de imágenes de software

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: What software environments are available on the hub?
es_419: ¿Qué entornos de software están disponibles en el hub?

source: How is containerization helpful for my work?
es_419: ¿En qué forma es útil el contenedor para mi trabajo?

source: Is there a way to customise my software environment?
es_419: ¿Hay alguna forma de personalizar mi entorno de software?

source: **Objectives**
es_419: **Objetivos**

source: Explain the value of reproducibility with containerized software environments
es_419: Explicar el valor de reproducibilidad con entornos de software contenedores

source: Select pre-configured JupyterLab or RStudio containers for their hub
es_419: Selección de contenedores JupyterLab o RStudio preconfigurados para sus hubs

source: Pull a custom container for their hub
es_419: Extracción de un contenedor personalizado para sus hubs

source: Software for research and education
es_419: Software para investigación y educación

source: Hub users usually require specific software packages to carry out their work. Installing software on a laptop significantly differs from installing software on a shared resource such as a hub in the cloud, largely because of different
es_419: Normalmente, los usuarios del hub requieren paquetes de software específicos para hacer su trabajo. Instalar software en una laptop difiere significativamente de instalar software en un recurso compartido como un hub en la nube, debido en gran medida a los diferentes

source: operating systems, e.g. Linux, macOS, Windows
es_419: sistemas operativos, por ejemplo, Linux, macOS o Windows

source: system libraries
es_419: bibliotecas del sistema

source: filesystems
es_419: sistemas de archivos

source: Due to these factors, a software installation on a user's local machine is difficult to reproduce and the installation process is often poorly documented and out of date.
es_419: Debido a estos factores, la instalación de software en una máquina local de un usuario es difícil de reproducir y el proceso de instalación a menudo está mal documentado y desactualizado.

source: Exercise: Software Challenges
es_419: Ejercicio: Desafíos en el software

source: Think about the challenges that you may have faced with using software for your work.
es_419: Piensa en los desafíos que afrontaste con el uso de software para tu trabajo.

source: Is there a tool that you wanted to use that was not compatible with your operating system?
es_419: ¿Hay alguna herramienta que quisieras utilizar pero no es compatible con tu sistema operativo?

source: Have you ever struggled to install a piece of software?
es_419: ¿Alguna vez has tenido problemas para instalar un software?

source: Did you and your collaborators fail to reproduce results using the same software application?
es_419: ¿Tú y tus colaboradores no pudieron reproducir los resultados usando la misma aplicación de software?

source: Write up your thoughts in our shared collaborative document.
es_419: Escribe tus ideas en nuestro documento de colaboración compartido.

source: Reproduce software environments with containers
es_419: Reproducción de entornos de software con contenedores

source: Containers are a useful technology for overcoming software challenges in reproducibility, portability and scalability. A container bundles up the software application and its dependencies into a lightweight and standalone package that can be run on any infrastructure.
es_419: Los contenedores son una tecnología útil para superar los desafíos que plantea el software con respecto a reproducibilidad, portabilidad y escalabilidad. Un contenedor agrupa la aplicación de software y sus dependencias en un paquete ligero y autónomo que puede ejecutarse en cualquier infraestructura.

source: Diagram of how a layer of many user software container environments shares the hub's underlying operating system and server infrastructure.
es_419: Diagrama sobre cómo una capa con muchos entornos de contenedores de software del usuario comparte el sistema operativo subyacente y la infraestructura del servidor.

source: Reproducibility
es_419: Reproducibilidad

source: An *image* is a reusable and shareable file that outlines the "recipe" needed to create a container. This is useful for reproducing a software environment since you can tag and keep track of the different versions of the image.
es_419: Una *imagen* es un archivo que se puede reutilizar y volver a compartir, y que describe la "receta" necesaria para crear un contenedor. Esto es útil para reproducir un entorno de software ya que se puede etiquetar y hacer un seguimiento de las diferentes versiones de la imagen.

source: Portability
es_419: Portabilidad

source: A container can run on different target systems, such as a laptop, supercomputer or cloud server.
es_419: Un contenedor puede ejecutarse en diferentes sistemas de destino, como una laptop, un súperordenador o un servidor en la nube.

source: Scalability
es_419: Capacidad de ampliación

source: Containers can be scaled up or down to take advantage of the system resources available (i.e. CPUs and RAM).
es_419: Los contenedores pueden ampliarse o reducirse para aprovechar los recursos del sistema disponibles (es decir, CPU y RAM).

source: Exercise: Reasons to use containers
es_419: Ejercicio: Razones para usar contenedores

source: Which of the following statements are *True* or *False*?
es_419: ¿Cuál de las siguientes afirmaciones son *verdaderas* o *falsas*?

source: Containers are lightweight, portable and isolated units of software that can be used on any computer and operating system.
es_419: Los contenedores son unidades de software ligeras, portátiles y aisladas que pueden utilizarse en cualquier computadora y sistema operativo.

source: An image is a runnable, self-contained software environment created from a container. A container is a shareable "recipe" used to create images.
es_419: Una imagen es un entorno de software ejecutable y autónomo que se crea a partir de un contenedor. Un contenedor es una "receta" que se puede compartir y se utiliza para crear imágenes.

source: A container enables reproducible modelling or analyses to be carried out on your laptop or in the cloud.
es_419: Un contenedor permite crear modelos o análisis que se pueden reproducir en tu laptop o en la nube.

source: Containers are easily scalable and can be deployed on many machines to distribute work.
es_419: Los contenedores pueden escalarse fácilmente y desplegarse en muchas máquinas para distribuir el trabajo.

source: Solution
es_419: Solución

source: *True*
es_419: *Verdadero*

source: *False* – A *container* is a runnable, self-contained software environment or service created from an *image*. An *image* is a shareable "recipe" used to create *containers*.
es_419: *Falso* - Un *contenedor* es un entorno de software o servicio ejecutable y autónomo que se crea a partir de una *imagen*. Una *imagen* es una "receta" que se puede compartir y se utiliza para crear *contenedores*.

source: For further resources on containerisation, please see {ref}`Further Resources<ref:resources>`.
es_419: Para ver más recursos sobre los contenedores, consulta {ref}`Recursos adicionales<ref:resources>`.

source: Selecting pre-configured containers on the hub
es_419: Selección de contenedores preconfigurados en el Hub

source: As seen in the previous episode, [](episode-server), a user is presented with a list of server options once logged into a hub and each option has an *Image* dropdown box.
es_419: Tal como se vio en el episodio anterior, [](episode-server), a un usuario se le presenta una lista de opciones del servidor una vez que se conecta a un hub y cada opción tiene un menú desplegable de *Imagen*.

source: Screenshot showing a list of server options available on the Community Showcase Hub.
es_419: Captura de pantalla donde se muestra una lista de opciones de servidor disponibles en el Hub.

source: On the [Community Showcase Hub](https://showcase.2i2c.cloud), the default list of images available include
es_419: En el [Hub de muestra comunitario de 2i2c](https://showcase.2i2c.cloud), la lista predeterminada de imágenes disponibles incluye

source: [Jupyter DataScience](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html#jupyter-datascience-notebook) - launches a JupyterLab interface with various Python[^ds-python], R[^ds-r] and Julia[^ds-julia] packages installed
es_419: [Jupyter DataScience](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html#jupyter-datascience-notebook) - lanza una interfaz de JupyterLab con varios paquetes instalados de Python[^ds-python], R[^ds-r] y Julia[^ds-ulevia]

source: [Rocker Geospatial](https://rocker-project.org/images/versioned/binder.html) – launches an RStudio interface with R packages[^ds-r] and geospatial toolkits installed
es_419: [Rocker Geospatial](https://rocker-project.org/images/versioned/binder.html) - Lanza una interfaz RStudio con paquetes R [^ds-r] y paquetes de herramientas geoespaciales instaladas

source: [Handbook Authoring](https://github.com/2i2c-org/community-showcase/tree/main/images/handbook-authoring-image) – a 2i2c-maintained image containing Python packages[^ha-python] for authoring documentation in Jupyter Book and MystMD
es_419: [Creación del manual](https://github.com/2i2c-org/community-showcase/tree/main/images/handbook-authoring-image) - Una imagen de 2i2c mantenida que contiene paquetes de Python[^ha-python] para crear documentación en Jupyter Book y MystMD

source: [Other...](episode-images:other) – allows a user to self-serve a JupyterHub-compatible custom image (see section below).
es_419: [Otro...](episode-images:other) - Permite a un usuario autoservir una imagen personalizada compatible con JupyterHub-(consulta la siguiente sección).

source: The list of image options presented can vary for different hubs. Hub Champions can build their own non-default environment and open a support ticket with 2i2c to modify this list to include non-default options – this is beyond the scope of this training although further details can be found in the [Hub Service Guide](https://docs.2i2c.org/admin/howto/environment/).
es_419: La lista de opciones de imagen presentadas puede variar en diferentes hubs. Los Campeones y Campeonas del Hub pueden construir su propio entorno no predeterminado y abrir un ticket de soporte en 2i2c para modificar esta lista para incluir opciones no predeterminadas. Esto está fuera del alcance de esta formación, aunque se pueden encontrar más detalles en la [Guía de servicio del Hub](https://docs.2i2c.org/admin/howto/environment/).

source: Choosing a custom image with the "Other..." option
es_419: Elegir una imagen personalizada con la opción "Otro..."

source: The *Other...* option allows a user to specify a custom image container to pull into the hub. There are many container registries online that host containerized applications, such as Docker Hub, GitHub, Azure, Amazon and Google Container Registries, Red Hat Quay, etc.
es_419: La opción *Otro...* permite que un usuario especifique una imagen de contenedor personalizada para introducir en el hub. Hay muchos registros de contenedores en línea que alojan aplicaciones contenedoras como Docker Hub, GitHub, Azure, Amazon y Google Container Registries, Red Hat Quay, etc.

source: **Only containers that are compatible with JupyterHub can be pulled into a hub**. To find JupyterHub-compatible containers you can, e.g.
es_419: **Solo los contenedores compatibles con JupyterHub pueden ser arrastrados a un hub**. Para encontrar contenedores compatibles con JupyterHub puedes, por ejemplo,

source: browse the list of 2i2c-maintained hub images on [Red Hat Quay](https://quay.io/organization/2i2c)
es_419: navegar por la lista de imágenes de concentradores mantenidas en 2i2c en [Red Hat Quay](https://quay.io/organization/2i2c)

source: take a look at [Jupyter Docker Stacks](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html)
es_419: darle un vistazo a los [Módulos Docker Jupyter](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html)

source: take a look at the [Rocker Project](https://rocker-project.org/images/) for R Docker containers (note only the `binder` image is JupyterHub-compatible)
es_419: darle un vistazo al [Proyecto Rocker](https://rocker-project.org/images/) para contenedores R Docker (ten en cuenta que solo la imagen `binder` es compatible con JupyterHub)

source: search Docker Hub for the term "jupyter".
es_419: buscar un Docker Hub para el término "jupyter".

source: Anyone can create a container and publicly share it online, therefore it is important to be cautious about downloading this software onto your machine. A few good indicators to look for are
es_419: Cualquier persona puede crear un contenedor y compartirlo públicamente en línea, así que es importante tener cuidado cuando descargues este software en tu máquina. Algunos buenos indicadores al buscar son

source: the image is updated regularly
es_419: la imagen se actualiza regularmente

source: the image is authored and maintained by a well-known company or community
es_419: la imagen es escrita y mantenida por una empresa o comunidad bien conocida

source: the container is used by many people
es_419: el contenedor es usado por mucha gente

source: there is an image file provided or metadata listing the exact contents of the container
es_419: hay un archivo de imagen proporcionado o metadatos que describen el contenido exacto del contenedor

source: documentation is provided on how to use the image.
es_419: se proporciona documentación sobre cómo utilizar la imagen.

source: An image listed on a container registry may have many different versions associated with it. A `TAG` is used to distinguish these different versions. The name of the container image can also include the `OWNER`. The general format for specifying an image is
es_419: Una imagen listada en un registro de contenedores puede tener muchas versiones diferentes asociadas a ella. Se utiliza un `TAG` para distinguir estas diferentes versiones. El nombre de la imagen del contenedor también puede incluir el `OWNER`. El formato general para especificar una imagen es

source: For example, if a user wanted to pull the [Jupyter PyTorch notebook](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html#jupyter-pytorch-notebook) container, then they would enter `quay.io/jupyter/pytorch-notebook:x86_64-pytorch-2.2.0` into the *Custom image* field.
es_419: Por ejemplo, si un usuario quiere extraer el contenedor [Jupyter PyTorch](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html#jupyter-pytorch-notebook), entonces debe introducir `quay.io/jupyter/pytorch-notebook:x86_64-pytorch-2.2.0` en el campo *Imagen personalizada*.

source: Screenshot showing where to specify a custom image quay.io/jupyter/pytorch-notebook:x86_64-pytorch-2.2.0 in the server options page on a hub.
es_419: Captura de pantalla donde se muestra dónde especificar una imagen personalizada quay.io/jupyter/pytorch-notebook:x86_64-pytorch-2.2.0 en la página de opciones del servidor en un hub.

source: We recommend always explicitly specifying a version number in the `TAG` field rather than using the generic `latest` tag. Providing the version number in the tag is useful for producing informative server logs for debugging purposes and allows you to check whether the correct version of the image is loaded into the hub by running the command
es_419: Recomendamos especificar siempre explícitamente un número de versión en el campo `TAG` en vez de usar la etiqueta genérica `latest`. Proporcionar el número de versión en la etiqueta es útil para generar registros informativos del servidor con fines de depuración y te permite comprobar si la versión correcta de la imagen se carga en el hub ejecutando el comando

source: Exercise: Specifying a custom image tag
es_419: Ejercicio: Especifica una etiqueta de imagen personalizada

source: Which of the following would you paste into the _Custom Image_ field to pull the latest version of the `handbook-authoring-image` from the list of 2i2c-maintained hub images on [Red Hat Quay](https://quay.io/organization/2i2c) to your hub?
es_419: ¿Cuál de las siguientes opciones pegarías en el campo _Custom Image_ para extraer la última versión de `handbook-authoring-image` de la lista de imágenes de concentradores mantenidas por 2i2c en [Red Hat Quay](https://quay.io/organization/2i2c) a tu hub?

source: Notes on the other answers:
es_419: Notas sobre las otras respuestas:

source: This is using an older version tag and not the latest version available.
es_419: Esto está utilizando una etiqueta de una versión anterior y no la última versión disponible.

source: This is missing the version tag.
es_419: A esto le falta la etiqueta de la versión.

source: Here you would need to remove the 'docker pull' part.
es_419: Aquí necesitarías eliminar la parte 'docker pull'.

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: Images are useful for reproducing software environments across platforms
es_419: Las imágenes son útiles para reproducir entornos de software entre plataformas

source: Default containers are available on the hub
es_419: Los contenedores predeterminados están disponibles en el hub

source: Additional custom containers can be pulled to the hub if required
es_419: Los contenedores personalizados adicionales pueden arrastrarse al hub si es necesario

source: such as `dask, h5py, matplotlib, pandas, scikit-learn, scipy, sympy`
es_419: tales como `dask, h5py, matplotlib, pandas, scikit-learn, scipy, sympy`

source: such as `caret, forecast, randomforest, rmarkdown, shiny, tidymodels, tidyverse`
es_419: tales como `caret, forecast, randomforest, rmarkdown, shiny, tidymodels, tidyverse`

source: such as `pluto` and `HDF5`
es_419: tales como `pluto` y `HDF5`

source: such as `jupyter-book` and `sphinx-intl`
es_419: tales como `jupyter-book` y `sphinx-intl`
