Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/server_resources.po
Languages: es_419

source: Selecting the optimal server resources for your computational work responsibly
es_419: Selección de los recursos óptimos del servidor para hacer tu trabajo informático de manera responsable

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: What's happening in the cloud when I run a server?
es_419: ¿Qué pasa en la nube cuando ejecuto un servidor?

source: How many CPU cores and RAM do I need?
es_419: ¿Cuántos núcleos de CPU y RAM necesito?

source: How can I reinstate the default environment of a user's server?
es_419: ¿Cómo puedo restablecer el entorno predeterminado del servidor de un usuario?

source: How can I gain control of a user's server for troubleshooting purposes?
es_419: ¿Cómo puedo tomar el control del servidor de un usuario para solucionar problemas?

source: **Objectives**
es_419: **Objetivos**

source: Select the most appropriate server resources for computational work
es_419: Seleccionar los recursos del servidor más apropiados para un trabajo computacional

source: Stop and restart a user's server
es_419: Detener y reiniciar el servidor de un usuario

source: Support a hub user by gaining control of their server
es_419: Apoyar a un usuario del hub tomando el control de su servidor

source: JupyterHub server options
es_419: Opciones del servidor JupyterHub

source: A hub provides interactive computing in the cloud to support research and education workflows for your community. Computational resources, such as the number of {ref}`CPU<glossary:cpu>` cores and {ref}`RAM<glossary:ram>`, can be provisioned on-demand to allow users to scale up or scale down their work as needed.
es_419: Un hub proporciona computación interactiva en la nube para apoyar los flujos de trabajo de investigación y educación para tu comunidad. Los recursos informáticos, tales como el número de núcleos {ref}`CPU<glossary:cpu>` y {ref}`RAM<glossary:ram>`, se pueden proporcionar bajo demanda para permitir a los usuarios aumentar o disminuir su trabajo según sea necesario.

source: Once a user is logged into the hub, they can launch a server configured with a set number of CPU cores and RAM.
es_419: Una vez que un usuario inició sesión en el hub, puede lanzar un servidor configurado con un número determinado de núcleos de CPU y RAM.

source: In this example, we will look at the server options available on the [Community Showcase Hub](https://showcase.2i2c.cloud).
es_419: En este ejemplo, veremos las opciones de servidores disponibles en el [Hub de muestra comunitario de 2i2c](https://showcase.2i2c.cloud).

source: Server options presented can vary for different hubs. Nevertheless, the number of CPU cores and RAM available is always clearly stated and the principles for selecting the optimal server resources for your computational work described in this section can still be applied.
es_419: Las opciones de servidores que presentamos pueden variar en diferentes hubs. Sin embargo, el número de núcleos de CPU y RAM disponibles siempre se indica claramente y los principios para seleccionar los recursos óptimos de un servidor para el trabajo computacional que se describen en esta sección aún pueden aplicarse.

source: Screenshot showing a list of server options available on the Community Showcase Hub.
es_419: Captura de pantalla donde se muestra una lista de opciones de servidores disponibles en el Hub de muestra comunitario de 2i2c.

source: Here, there are four server options presented
es_419: Aquí presentamos cuatro opciones de servidores

source: Shared Small: 1–4 CPU, 8–32 GB RAM
es_419: Pequeño compartido: 1-4 CPU, 8-32 GB de RAM

source: Small: 4 CPU, 32 GB RAM
es_419: Pequeño: 4 CPU, 32 GB de RAM

source: Medium: 16 CPU, 128 GB RAM
es_419: Mediano: 16 CPU, 128 GB de RAM

source: Large: 64 CPU, 512 GB RAM.
es_419: Grande: 64 CPU, 512 GB RAM.

source: We shall explore the *Image* dropdown box further in the next episode, {ref}`episode-images`.
es_419: En el próximo episodio exploraremos el menú desplegable *Imágenes* {ref}`episode-images`.

source: Exercise: Local versus Cloud computing – What's the difference?
es_419: Ejercicio: Computación local vs. en la nube - ¿Cuál es la diferencia?

source: How does the number of CPUs and RAM available on the hub compare with your personal computer? What impact does access to these cloud resources have on your user's work?
es_419: ¿Cómo se compara el número de CPUs y RAM disponibles en el hub con tu computadora personal? ¿Qué impacto tiene el acceso a estos recursos en la nube en el trabajo de tu usuario?

source: Solution
es_419: Solución

source: In general, more CPU cores available in the cloud allow for more work to be done in *parallel* and reduce time to solution (a CPU-bound program). Parallel computing is where multiple CPU cores can be used simultaneously to solve a computational problem, e.g. running the same processing task on several different datasets.
es_419: En general, tener más núcleos de CPU disponibles en la nube permiten hacer más trabajo *en paralelo* y disminuir el tiempo para hallar la solución (un programa limitado por CPU). La computación paralela es cuando varios núcleos de CPU pueden usarse simultáneamente para resolver un problema computacional ejecutando la misma tarea de procesamiento en varios conjuntos de datos diferentes.

source: However, using more CPU cores does not automatically improve performance since the rate at which information is accessed in RAM can become a limiting factor (a memory-bound program), or simply the program is designed to be executed in *serial* and not in parallel.
es_419: Sin embargo, usar más núcleos de CPU no mejora automáticamente el rendimiento, ya que la velocidad a la que se accede a la información en la RAM puede convertirse en un factor limitante (un programa limitado por memoria), o simplemente el programa está diseñado para ejecutase *en serie* y no en paralelo.

source: Using cloud resources responsibly
es_419: Uso responsable de los recursos de la nube

source: By selecting a server option, a user is remotely launching a server that is provided by a commercial vendor, such as Google Cloud, AWS or Microsoft Azure. Selecting a larger server incurs a larger financial cost, as well as an environmental cost! Therefore it is important to use cloud resources responsibly to maximize efficiency and minimize carbon emissions.
es_419: Al seleccionar una opción de servidor, un usuario ejecuta remotamente un servidor que es proporcionado por un proveedor comercial, como Google Cloud, AWS o Microsoft Azure. La selección de un servidor más grande implicara un mayor costo financiero, así como un mayor costo ambiental. Por lo tanto, es importante utilizar los recursos en la nube de forma responsable para maximizar la eficiencia y minimizar las emisiones de carbono.

source: Best practices for using cloud resources responsibly include
es_419: Las prácticas recomendadas para usar los recursos en la nube de manera responsable incluyen

source: {ref}`shutting down<episode-server:shutdown-server>` a cloud server as soon as you are finished with your work
es_419: {ref}`cerrar<episode-server:shutdown-server>` el servidor en la nube tan pronto como termines tu trabajo

source: selecting the server option with the minimum number of CPU cores and RAM needed to carry out your work
es_419: seleccionar la opción del servidor que tenga el número mínimo de núcleos de CPU y RAM necesarios para llevar a cabo tu trabajo

source: running code efficiently and developing sustainable research software where possible, e.g. test your program first before scaling to a larger job.
es_419: ejecutar el código de manera eficiente y desarrollar software de investigación sostenible siempre que sea posible, por ejemplo, prueba tu programa primero antes de escalarlo a un trabajo más grande.

source: Exercise: Optimize server resources for your work
es_419: Ejercicio: Optimiza los recursos del servidor para tu trabajo

source: In each scenario, select the option that makes the best use of the following server resources: *Shared Small: 1–4 CPU, 8–32 GB RAM, Small: 4 CPU, 32 GB RAM, Medium: 16 CPU, 128 GB RAM, Large: 64 CPU, 512 GB RAM*.
es_419: En cada escenario, selecciona la opción que utilice mejor los siguientes recursos del servidor: *Pequeño compartido: 1-4 CPU, 8-32 GB RAM, Pequeño: 4 CPU, 32 GB RAM, Mediano: 16 CPU, 128 GB RAM, Grande: 64 CPU, 512 GB RAM*.

source: a. Run a software pipeline where each task requires 2GB of RAM and 60 tasks in total.
es_419: a. Ejecutar un proceso de software donde cada tarea requiere 2GB de RAM y 60 tareas en total.

source: b. Create documentation and edit text files.
es_419: b. Crear documentación y editar archivos de texto.

source: c. Preprocess a dataset consisting of 10,000 images, where each image is 16 MB in size.
es_419: c. Preprocesar un conjunto de datos que consta de 10.000 imágenes, donde cada imagen tiene un tamaño de 16 MB.

source: a. *Medium: 16 CPU, 128 GB RAM* – the memory required is $ 60 \times 2 \, \mathrm{GB} = 120 \, \mathrm{GB}$, therefore the RAM on a *Medium* machine is sufficient.
es_419: a. *Mediano: 16 CPU, 128 GB RAM* - La memoria requerida es de $60 \times 2 \, \mathrm{GB} = 120 \, \mathrm{GB}$, por lo tanto la RAM de una máquina *mediana* es suficiente.

source: b. *Shared Small: 1–4 CPU, 8–32 GB RAM* – this is not a computationally intensive task so a machine shared with other users is sufficient.
es_419: b. *Pequeño compartido: 1-4 CPU, 8-32 GB RAM* - Esta no es una tarea de computación intensiva, de modo que una máquina compartida con otros usuarios es suficiente.

source: c. *Large: 64 CPU, 512 GB RAM* – the total dataset size is $10000 \times 16 \, \mathrm{MB} = 160 000 \, \mathrm{MB} = 160 \, \mathrm{GB}$, which is too large for the *Medium* machine to hold in memory at once. Alternatively, you could chunk up your dataset and preprocess each batch on a smaller machine, which would be slower. Image preprocessing is often a CPU-bound process in deep learning workflows, so a *Large* machine with more CPU cores is best for performance.
es_419: c. *Grande: 64 CPU, 512 GB RAM* - El tamaño total del conjunto de datos es de $10000 \veces 16 \, \mathrm{MB} = 160 000 \, \mathrm{MB} = 160 \, \mathrm{GB}$, lo cual es demasiado grande para que la máquina *Mediana* mantenga en la memoria a la vez. De manera alternativa, podrías dividir el conjunto de datos y preprocesar cada lote en una máquina más pequeña, lo que sería más lento. A menudo, el preprocesamiento de imágenes es un proceso limitado por CPU en flujos de trabajo con aprendizaje profundo, de modo que una máquina *Grande* con más núcleos CPU es mejor para el rendimiento.

source: **Challenge**
es_419: **Desafío**

source: Sofía wants to run a new program but does not know its maximum memory requirement. She tried compiling it on a Shared Small machine, where it was initially built but then ran out of memory and failed on execution. Which server configuration should Sofía choose to try to run the program again?
es_419: Sofía quiere ejecutar un nuevo programa pero no conoce los requisitos máximos de la memoria. Trató de compilarlo en una máquina pequeña compartida, donde se compiló inicialmente, pero después se quedó sin memoria y la ejecución falló. ¿Qué configuración debería elegir Sofía en el servidor para tratar de ejecutar nuevamente el programa?

source: *Small: 4 CPU, 32 GB RAM* – the task failed on a *Shared Small* machine and we recommend sizing up incrementally if you are unsure of the server resources you need.
es_419: *Pequeño: 4 CPU, 32 GB RAM* - La tarea falló en una máquina *pequeña compartida*, nuestra recomendación es que aumente el tamaño de manera incremental si no está segura de los recursos que necesita.

source: Automatic server culling
es_419: Detención automática del servidor

source: Hubs automatically cull servers after a period of inactivity to improve resource utilization and safeguard against excessive cloud costs. This occurs after **1 hour** of user inactivity.
es_419: Los hubs detienen automáticamente los servidores después de un periodo de inactividad para mejorar la utilización de los recursos y protegerse de los costos excesivos en la nube. Esto ocurre después de que el usuario está inactivo durante **1 hora**.

source: Executing a piece of long-running code with a running kernel is not recognised as user activity on the server and so the process is killed after 1 hour. This is a rare use case of interactive computing on a hub, but this limit can be reconfigured for a particular hub upon request by contacting [2i2c support](https://docs.2i2c.org/support).
es_419: La ejecución de una parte de código de larga duración con un núcleo en ejecución no es reconocido como actividad del usuario en el servidor y por lo tanto el proceso finaliza después de 1 hora. Este es un caso de uso atípico de la computación interactiva en un hub, pero este límite puede reconfigurarse para un hub en particular si lo solicitas comunicándote con el [soporte de 2i2c](https://docs.2i2c.org/support).

source: Shutting down a server as a user
es_419: Apagar un servidor como usuario

source: A user should shut down their server on the hub once they are finished with their work. This can be done manually by applying the following steps.
es_419: Un usuario debería apagar su servidor en el hub una vez que haya terminado su trabajo. Esto se puede hacer manualmente aplicando los siguientes pasos.

source: (JupyterLab) Navigate to *File > Hub Control Panel*, or alternatively (JupyterLab and RStudio) navigate to the URL `https://<your-hub-url>.2i2c.cloud/hub/home`
es_419: (JupyterLab) Ve a *File (Archivo) > Hub Control Panel (Panel de control del Hub)*, o alternativamente (JupyterLab y RStudio) consulta la URL `https://<url-de-tu-hub>.2i2c.cloud/hub/home`

source: In the Hub Control Panel, click on the ![Stop My Server](../media/episodes/server_resources/shutdown-2.png) button
es_419: En el Panel de control del Hub, haz clic en el botón ![Stop My Server](../media/episodes/server_resources/shutdown-2.png)(Detener mi servidor)

source: Stop My Server
es_419: Detener mi servidor

source: Screenshot showing the File > Hub Control Panel menu option in the JupyterLab user interface.
es_419: Captura de pantalla donde se muestra la opción del menú File (Archivo) > Hub Control Panel (Panel de control del Hub) en la interfaz de usuario de JupyterLab.

source: Managing another user's server as a Hub Champion
es_419: Administración del servidor de otro usuario como un Campeón o Campeona del Hub

source: Hub Champions have access to an Admin panel from the Hub Control Panel (or the URL `https://<your-hub-url>.2i2c.cloud/hub/admin`).
es_419: Los Campeones y Campeonas del Hub tienen acceso a un panel de administración desde el Panel de control del Hub (o la URL `https://<url-de-tu-hub>.2i2c.cloud/hub/admin`).

source: Screenshot showing the Admin panel available to Hub Champions.
es_419: Captura de pantalla donde se muestra el panel de administración disponible para los Campeones y Campeonas del Hub.

source: With great power comes great responsibility.
es_419: Un gran poder conlleva una gran responsabilidad.

source: Spiderman
es_419: El hombre araña

source: Performing administrative actions as a Hub Champion should be done with great care. Respect the privacy of others and think before you act.
es_419: Llevar a cabo acciones administrativas como un Campeón o Campeona del Hub debe hacerse con mucho cuidado. Respeta la privacidad de los demás y piensa antes de actuar.

source: A user's server may sometimes become unresponsive, e.g. issues stemming from self-installed software via `pip` and/or `conda`. Hub Champions can restore user servers to their default environment by stopping and restarting their server by clicking the ![Stop Server](../media/episodes/server_resources/manage-2.png) followed by the ![Start Server](../media/episodes/server_resources/manage-3.png) button next to the user's name from the Admin panel.
es_419: A veces el servidor de un usuario puede dejar de responder, por ejemplo, debido a problemas relacionados con el software que se instaló automáticamente mediante `pip` y/o `conda`. Los Campeones y Campeonas del Hub pueden restaurar los servidores del usuario a su entorno predeterminado si detienen y reinician su servidor haciendo clic en ![Start Server](. /media/episodes/server_resources/manage-2.png)(Iniciar el servidor) y después presionando el botón ![Start Server](../media/episodes/server_resources/manage-3.png)(Iniciar el servidor) que se encuentra junto al nombre del usuario en el panel de administración.

source: Stop Server
es_419: Detener servidor

source: Start Server
es_419: Iniciar servidor

source: Self-installed software packages on the hub are *temporary* and are removed each time a server is shut down to maintain a clean default software environment. Software is provided between sessions by {ref}`episode-images`, which is covered in the next episode.
es_419: Los paquetes de software que se autoinstalan en el hub son *temporales* y se eliminan cada vez que un servidor se apaga para mantener el entorno de software limpio de manera predeterminada. El software persiste entre las sesiones mediante {ref}`episode-images`, las cuales se cubrirán en el próximo episodio.

source: Access a user's server
es_419: Acceso al servidor de un usuario

source: Hub Champions can gain control of a user's server that is currently running by clicking the ![Access Server](../media/episodes/server_resources/manage-4.png) button next to the user's name from the Admin panel.
es_419: Los Campeones y Campeonas del Hub pueden tomar el control del servidor de un usuario que se está ejecutando haciendo clic en el botón ![Access Server](../media/episodes/server_resources/manage-4.png)(Acceder al servidor) que se encuentra junto al nombre del usuario en el panel de administración.

source: Access Server
es_419: Acceso al servidor

source: From here a Hub Champion can navigate the server *as if they are the user themselves*, which is useful for reproducing and debugging issues.
es_419: Desde ahí un Campeón o Campeona del Hub puede navegar en el servidor *como si fuera el propio usuario*, lo cual es útil para la detección y resolución problemas.

source: Exercise: User server management
es_419: Ejercicio: Administración del servidor del usuario

source: Are the following statements *True* or *False*?
es_419: ¿Las siguientes afirmaciones son *Verdaderas* o *Falsas*?

source: a. Closing the browser window is enough to stop a server.
es_419: a. Cerrar la ventana del navegador es suficiente para detener un servidor.

source: b. Stopping a server when a user is finished with their work reduces costs and carbon emissions.
es_419: b. Detener un servidor cuando un usuario termina su trabajo reduce los costos y las emisiones de carbono.

source: c. Stopping and restarting a server removes `pip` and `conda` user-installed packages and restores a clean state.
es_419: c. Detener y reiniciar un servidor elimina los paquetes `pip` y `conda` instalados por el usuario y lo restaura a un estado limpio.

source: d. A user server will continue to run indefinitely unless stopped.
es_419: d. El servidor de un usuario seguirá ejecutándose indefinidamente a menos que alguien lo detenga.

source: a. *False* – the server will continue to run unless the *Stop my Server* button is clicked or will be automatically culled after 1 hour of inactivity by default.
es_419: a. *Falso* - El servidor seguirá ejecutándose a menos que se haga clic en el botón *Stop my server* (Detener mi servidor) o se detendrá automáticamente de manera predeterminada después de 1 hora de inactividad.

source: b. *True* – running a server utilises computational resources that are billed by the cloud provider and consumes energy.
es_419: b. *Verdadero* - Ejecutar un servidor utiliza recursos computacionales que son facturados por el proveedor de la nube y consume energía.

source: c. *True* – sometimes user-installed packages can introduce software dependency conflicts that can be removed by restarting the server.
es_419: c. *Verdadero* - A veces los paquetes instalados por el usuario pueden introducir conflictos de dependencia de software que se pueden eliminar reiniciando el servidor.

source: d. *False* – servers are culled after 1 hour of inactivity by default. If a user requires a long-running process exceeding this period, then they should request an extension to this limit through their Hub Champion.
es_419: d. *Falso* - Los servidores se detienen de manera predeterminada después de 1 hora de inactividad. Si un usuario requiere un proceso de larga duración que exceda dicho periodo, entonces debe solicitar una ampliación de este límite mediante su Campeón o Campeona del Hub.

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: Users can launch servers with a variety of resources available, namely the number of CPU cores and RAM.
es_419: Los usuarios pueden lanzar servidores con una gran variedad de recursos disponibles, a saber el número de núcleos del CPU y la RAM.

source: It is important to use cloud resources responsibly to maximize efficiency and minimize carbon emissions.
es_419: Es importante utilizar los recursos en la nube de manera responsable para maximizar la eficiencia y minimizar las emisiones de carbono.

source: Hub Champions can stop, restart and gain control of a user's server for troubleshooting purposes.
es_419: Los Campeones y Campeonas del Hub pueden detener, reiniciar y tomar el control del servidor de un usuario para solucionar problemas.
