Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/transfer_data.po
Languages: es_419

source: Navigating the filesystem and transferring data to and from the hub
es_419: Navegación por el sistema de archivos y transferencia de datos desde y hacia el hub

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: Where do I store files on the hub?
es_419: ¿Dónde almaceno los archivos en el hub?

source: How do I transfer data to and from the hub?
es_419: ¿Cómo transfiero datos desde y hacia el hub?

source: How do I authorise GitHub to push and pull code to the hub?
es_419: ¿Cómo autorizo a GitHub para introducir y extraer código en el hub?

source: **Objectives**
es_419: **Objetivos**

source: Recognise and locate your home directory in the JupyterLab and RStudio user interface
es_419: Reconocer y localizar tu directorio principal en la interfaz de usuario de JupyterLab y RStudio

source: Distribute read-only datasets to all hub users in a shared directory
es_419: Distribuir conjuntos de datos de solo lectura a todos los usuarios del hub en un directorio compartido

source: Push and pull GitHub repositories to and from the hub with `gh-scoped-creds`
es_419: Introducir y extraer los repositorios de GitHub desde y hacia el hub con `gh-scoped-creds`

source: Home directory
es_419: Directorio principal

source: A hub server comes with its own filesystem that is private to the user and not shared with other hub users. Every user on the hub is given the username `jovyan`[^jovyan] and their home directory is located at
es_419: Un servidor del hub incluye su propio sistema de archivos privado para el usuario y no se comparte con otros usuarios del hub. Cada usuario del hub recibe el nombre de usuario `jovyan`[^jovyan] y su directorio principal se encuentra en

source: Both the JupyterLab and RStudio user interfaces will automatically open the file explorer in the user's home directory in the first instance when a server is launched (see {numref}`fig-jupyterlab` and {numref}`fig-rstudio`).
es_419: Tanto las interfaces de usuario de JupyterLab como las de RStudio abrirán automáticamente el explorador de archivos en el directorio principal del usuario en la primera instancia cuando se ejecuta un servidor (consulta {numref}`fig-jupyterlab` y {numref}`fig-rstudio`).

source: Files saved in the home directory are persistent and are available on the hub each time a user shuts down and starts a server.
es_419: Los archivos que se guardan en el directorio de inicio son persistentes y están disponibles en el hub cada vez que un usuario apaga e inicia un servidor.

source: The file explorer (highlighted with a blue box) in the JupyterLab user interface.
es_419: El explorador de archivos (resaltado con un cuadro azul) en la interfaz de usuario de JupyterLab.

source: The file explorer (highlighted with a blue box) in the RStudio user interface.
es_419: El explorador de archivos (resaltado con un cuadro azul) en la interfaz de usuario de RStudio.

source: The storage quota for home directories is **not capped and storage costs are charged per gigabyte**. Therefore we strongly suggest this space is used for small files and datasets and **is not suitable for storing large datasets.**
es_419: La cuota de almacenamiento de los directorios principales**no está limitada y los costos de almacenamiento se cobran por gigabyte**. Por lo tanto, sugerimos que este espacio se utilice para archivos y conjuntos de datos pequeños y **no es adecuado para almacenar conjuntos de datos grandes**.

source: Hub champions are responsible for costs incurred from data storage and ensuring their communities understand the potential expenses incurred.
es_419: Los Campeones y Campeonas del Hub son responsables de los costos del almacenamiento de los datos y garantizan que sus comunidades entiendan los posibles costos.

source: Exercise: What can you store in your home directory?
es_419: Ejercicio: ¿Qué puedes almacenar en tu directorio principal?

source: Select all that apply:
es_419: Selecciona todos los que correspondan:

source: Code
es_419: Código

source: Large and/or shared datasets with read-write permissions
es_419: Conjuntos de datos grandes y/o compartidos con permisos de lectura-escritura

source: Text files
es_419: Archivo de texto

source: Small datasets
es_419: Bases de datos pequeñas

source: Configuration files
es_419: Archivos de configuración

source: Read-only datasets, e.g for teaching
es_419: Conjuntos de datos de solo lectura, por ejemplo para docencia

source: Temporary data, e.g. intermediate results from a calculation
es_419: Datos temporales, por ejemplo, resultados intermedios de un cálculo

source: Solution
es_419: Solución

source: ✅ Code
es_419: ✅ Código

source: ❌ Large and/or shared datasets with read-write permissions – *consider using Cloud Object Storage or other cloud-native storage solutions*
es_419: ❌ Conjuntos de datos grandes y/o compartidos con permisos de lectura-escritura - *Considera usar el almacenamiento de objetos en la nube u otras soluciones de almacenamiento nativo en la nube*

source: ✅ Text files
es_419: ✅ Archivo de texto

source: ✅ Small datasets
es_419: ✅ Bases de datos pequeñas

source: ✅ Configuration files
es_419: ✅ Archivos de configuración

source: ❌ Read-only datasets, e.g for teaching – *consider placing these files in the `~/shared` directory*
es_419: ❌ Conjuntos de datos de solo lectura, por ejemplo, para docencia - *Considera colocar estos archivos en el directorio `~/shared`*

source: ❌ Temporary data, e.g. intermediate results from a calculation – *consider using the `/tmp` directory*
es_419: ❌ Datos temporales, por ejemplo, resultados intermedios obtenidos a partir de un cálculo - *Considera usar el directorio `/tmp`*

source: Shared directory
es_419: Directorio compartido

source: The shared-readwrite folder appears for Hub Champions only.
es_419: La carpeta de lectura-escritura compartida solo se muestra para los Campeones y Campeonas del Hub.

source: The *shared-readwrite* folder appears for Hub Champions only.
es_419: La carpeta de *lectura-escritura compartida* solo se muestra para los Campeones y Campeonas del Hub.

source: All hub users have access to a common *shared* directory from their home directory. This is a read-only directory where users can access large files or datasets for their work and its contents cannot be accidentally modified or deleted.
es_419: Todos los usuarios del hub tienen acceso a un directorio *compartido* común desde su directorio personal. Este es un directorio de solo lectura en el que los usuarios pueden acceder a archivos grandes o conjuntos de datos para su trabajo, y sus contenidos no pueden modificase ni borrarse accidentalmente.

source: Hub Champions can populate the *shared directory* by placing files in the *shared-readwrite* directory that appears only in their home directory.
es_419: Los Campeones y Campeonas del Hub pueden completar el directorio de *lectura-escritura compartida* colocando archivos en el directorio *lectura-escritura compartida* que aparece solo en su directorio principal.

source: **Upload data to the hub**
es_419: **Subir datos al hub**

source: Upload files to the hub by
es_419: Subir archivos al Hub

source: Clicking the ![*upload*](../media/episodes/transfer_data/jlab-upload.png) button at the top of the file explorer.
es_419: Haciendo clic en el botón ![*upload*](../media/episodes/transfer_data/jlab-upload.png) (subir) que se encuentra en la parte superior del explorador de archivos.

source: upload
es_419: subir

source: Clicking the ![*upload*](../media/episodes/transfer_data/rstudio-upload.png) button at the top of the file explorer.
es_419: Haciendo clic en el botón ![*upload*](../media/episodes/transfer_data/rstudio-upload.png) (subir) que se encuentra en la parte superior del explorador de archivos.

source: **Download data from the hub**
es_419: **Descargar datos del hub**

source: Download files from the hub by
es_419: Descargar archivos del hub

source: Right-clicking on the target file/folder and clicking the ![*download*](../media/episodes/transfer_data/jlab-download.png) button.
es_419: Haciendo clic derecho en el archivo/carpeta de destino y en el botón ![*download*](../media/episodes/transfer_data/jlab-download.png) (descargar).

source: download
es_419: descargar

source: Checking the box next to the target file/folder, clicking the ![*settings*](../media/episodes/transfer_data/rstudio-cog.png) button, choosing the *Export...* option and confirming the filename in the following dialog box.
es_419: Marcando la casilla que se encuentra junto al archivo/carpeta de destino, haciendo clic en el botón ![*settings*](../media/episodes/transfer_data/rstudio-cog.png) (ajustes), eligiendo la opción *Export...* (Exportar...) y confirmando el nombre del archivo en el cuadro de diálogo siguiente.

source: settings
es_419: ajustes

source: The /tmp directory
es_419: El directorio /tmp

source: The `/tmp` directory is used to temporarily store short-lived files. Any file placed in this directory will last for the duration of your session and will be deleted after you log out.
es_419: El directorio `/tmp` se utiliza para almacenar temporalmente archivos de corta duración. Cualquier archivo que se coloque en este directorio tendrá la duración de tu sesión y se eliminará después de que cierres la sesión.

source: This directory is a SSD drive with fast read-write access and up to 50 – 100 GBs of disk space. Ideal use cases for `/tmp` are for processing large datasets that do not need to be stored permanently.
es_419: Este directorio es una unidad SSD con acceso rápido de lectura y escritura de hasta 50 - 100 GB de espacio en disco. El caso de uso ideal para `/tmp` es procesar conjuntos de datos grandes que no necesitan almacenarse permanentemente.

source: Cloud Object Storage
es_419: Almacenamiento de objetos en la nube

source: Your hub lives in the cloud, therefore another way to store data is using object storage such as Amazon S3 or Google Cloud Storage. This type of storage is ideally suited for persistent, large datasets that would be otherwise expensive to store on a traditional filesystem (i.e. your home, shared or `/tmp` folder) long-term.
es_419: Tu hub se encuentra en la nube, así que otra forma de almacenar datos es utilizando el almacenamiento de objetos como Amazon S3 o Google Cloud Storage. Este tipo de almacenamiento es ideal para conjuntos de datos grandes y persistentes que, de otra manera, sería costoso almacenar en un sistema de archivos tradicional (por ejemplo, tu hogar, carpeta compartida `/tmp`) a largo plazo.

source: This is an advanced topic beyond the scope of the current Hub Champion Training curriculum. More information can be found at the [2i2c Hub Service Guide](https://docs.2i2c.org/user/topics/data/object-storage/).
es_419: Este es un tema avanzado que va más allá del alcance del currículum actual de los Campeones y Campeonas del Hub. Puedes encontrar más información en la [Guía de servicios del hub de 2i2c](https://docs.2i2c.org/user/topics/data/object-storage/).

source: Exercise: Data requirements
es_419: Ejercicio: Requisitos para los datos

source: Think about the data that you or your community require for your/their work.
es_419: Piensa en los datos que tú o tu comunidad necesitan para trabajar.

source: What type of data is it? E.g. tabular data (.csv, .xls), images (.png, .jpg, .bmp), other scientific data formats (.h5, .nc, .fastq)
es_419: ¿Qué tipo de datos son? Por ejemplo, datos de tabulaciones (.csv, .xls), imágenes (.png, .jpg, .bmp), otros formatos de datos científicos (.h5, .nc, .fastq)

source: How large is a typical dataset?
es_419: ¿Qué tamaño tiene un conjunto de datos normal?

source: Where is the data stored?
es_419: ¿Dónde se almacenan los datos?

source: Is the same dataset used by a group of collaborators?
es_419: ¿Un grupo de colaboradores utiliza el mismo conjunto de datos?

source: Write up your thoughts in our shared collaborative document.
es_419: Escribe tus ideas en nuestro documento de colaboración compartido.

source: Share and manage code with GitHub
es_419: Compartir y administrar código con GitHub

source: GitHub is a popular *hosting platform* for creating, storing, managing and sharing code with collaborators. Code developed on a hub can be synchronised with a remote repository on GitHub, and changes are tracked in a process known as version control. This allows users to compare and even restore different versions of the code and facilitates collaborative work across different machines. Git is a *version control tool* that enables the synchronisation of code with GitHub. On a hub, version control of code is possible by using Git extensions to the user interface. Learn more about how to use these:
es_419: GitHub es una *plataforma de alojamiento* popular para crear, almacenar, administrar y compartir código con colaboradores. El código desarrollado en un hub puede sincronizarse con un repositorio remoto en GitHub y los cambios se rastrean en un proceso conocido como control de versiones. Esto permite a los usuarios comparar e incluso restaurar diferentes versiones del código y facilita el trabajo colaborativo en diferentes máquinas. Git es una *herramienta para el control de versiones* que permite la sincronización de código con GitHub. En un hub, el control de versiones del código es posible utilizando extensiones Git en la interfaz de usuario. Obtén más información sobre cómo usarlos:

source: [Git extension for JupyterLab](https://blog.reviewnb.com/jupyterlab-git-extension/#git-workflow)
es_419: [Extensión Git para JupyterLab](https://blog.reviewnb.com/jupyterlab-git-extension/#git-workflow)

source: [Git extension for RStudio](https://docs.posit.co/ide/user/ide/guide/tools/version-control.html#integrations).
es_419: [Extensión Git para RStudio](https://docs.posit.co/ide/user/ide/guide/tools/version-control.html#integrations).

source: We recommend performing git operations using the HTTPS protocol and not SSH, since on the hub HTTPS will always work behind a firewall or proxy.
es_419: Recomendamos hacer operaciones en el git usando el protocolo HTTPS y no el SSH, ya que en el hub, HTTPS siempre funcionará detrás de un firewall o proxy.

source: When a user pulls and pushes code to a remote repository on GitHub, they will be prompted to provide their GitHub credentials.
es_419: Cuando un usuario extrae e introduce código a un repositorio remoto en GitHub, se le pedirá que proporcione sus credenciales de GitHub.

source: *We do not recommend entering your GitHub credentials (GitHub password, personal access tokens or otherwise) on any kind of shared infrastructure (e.g. private and public cloud, HPC, any remote machine)* as this information will be at risk.
es_419: *No recomendamos que introduzcas tus credenciales de GitHub (contraseña de GitHub, tokens de acceso personal o de cualquier otro tipo) en ningún tipo de infraestructura compartida (por ejemplo, nube privada y pública, HPC, cualquier máquina remota)*, ya que esta información estará en riesgo.

source: For JupyterLab, we highly advise using `gh-scoped-creds` for authentication on our hubs.
es_419: Para JupyterLab, aconsejamos encarecidamente usar `gh-scoped-creds` para la autenticación en nuestros hubs.

source: Using `gh-scoped-creds`
es_419: Uso de `gh-scoped-creds`

source: This feature may not be enabled for all hub configurations. Hub Champions may refer to {ref}`Enabling gh-scoped-creds for your hub<episode-data:enable-gh-scoped-creds>` for more details.
es_419: Es posible que esta función no esté habilitada para todas las configuraciones del hub. Los Campeones y Campeonas del Hub pueden consultar {ref}`Habilitación de cred-gh-scoped-creds para tu hub<episode-data:enable-gh-scoped-creds>` para obtener más información.

source: Authorisation to pull and push to GitHub is handled with [`gh-scoped-creds`](https://github.com/yuvipanda/gh-scoped-creds/).
es_419: La autorización para la introducción y extracción en GitHub se maneja con [`gh-scoped-creds`](https://github.com/yuvipanda/gh-scoped-creds/).

source: Open a Terminal.
es_419: Abrir una terminal.

source: Run the command `gh-scoped-creds`.
es_419: Ejecuta el comando `gh-scoped-creds`.

source: If the prompt does not appear and you see `bash: gh-scoped-creds: command not found` instead, then gh-scoped-creds is not installed in the image selected for your server. See the [Hub Service Guide - Customize a community-maintained upstream image](https://docs.2i2c.org/admin/howto/environment/customize-image/) to add packages to a community-maintained upstream image.
es_419: Si el prompt no aparece y en vez de ello ves `bash: gh-scoped-creds: comando no encontrado`, entonces gh-scoped-creds no está instalado en la imagen seleccionada para tu servidor. Consulta la [Guía de servicio del Hub - Personalizar una imagen de flujo ascendente mantenida por la comunidad](https://docs.2i2c.org/admin/howto/environment/customize-image/) para agregar paquetes a una imagen original mantenida por la comunidad.

source: The following prompt will appear
es_419: Se mostrará el siguiente prompt

source: Copy the code from the prompt and paste it into [https://github.com/login/device](https://github.com/login/device) as instructed.
es_419: Copia el código desde el prompt y pégalo en [https://github.com/login/device](https://github.com/login/device) tal como se indica.

source: Authorise the hub to access GitHub by clicking the green button with the label *Authorize <name of hub>*.
es_419: Autoriza al hub para acceder a GitHub haciendo clic en el botón verde que tiene la etiqueta *Authorize (Autorizar) <name of hub>*.

source: You should now be able to pull and push to GitHub from the hub without entering your credentials.
es_419: Ahora deberías ser capaz de extraer e introducir a GitHub desde el hub sin introducir tus credenciales.

source: Authorisation will automatically expire after 8 hours (or when your JupyterHub server stops), and you'll have to repeat these steps to renew.
es_419: La autorización expirará automáticamente después de 8 horas (o cuando tu servidor JupyterHub se detenga), y tendrás que repetir estos pasos para renovarla.

source: If you receive a `Permission denied` error after following these steps, then `gh-scoped-creds` has not been enabled for your hub. Hub Champions should refer to the steps in {ref}`Enabling gh-scoped-creds for your hub<episode-data:enable-gh-scoped-creds>`.
es_419: Si recibes un error que dice `Permiso denegado` después de seguir estos pasos, entonces `gh-scoped-creds` no fue habilitado para tu hub. Los Campeones y Campeonas del Hub deben consultar los pasos en {ref}`Habilitación de cred-gh para tu hub<episode-data:enable-gh-scoped-creds>`.

source: Enabling `gh-scoped-creds` for your hub
es_419: Habilitación de `gh-scoped-creds` para tu hub

source: If this is not already enabled for your hub, then there are some extra steps for Hub Champions to enable `gh-scoped-creds` (requires GitHub Organization owner permissions).
es_419: Si esta opción no está ya habilitada para tu hub, entonces se deben seguir algunos pasos adicionales para que los Campeones y Campeonas del Hub habiliten `gh-scoped-creds` (requiere permisos del propietario de la organización de GitHub).

source: Check that `gh-scoped-creds` is not already enabled for your hub by opening a Terminal and running
es_419: Revisa que `gh-scoped-creds` ya no esté habilitado para tu Hub abriendo una Terminal y ejecutándola

source: If this returns nothing, then follow the next step.
es_419: Si esta acción no devuelve ningún resultado, ve al siguiente paso.

source: If this returns a client ID of the form `Iv1.xxxxxxxxxxxxxxxx`, then go to Step 3.
es_419: Si esta acción devuelve un ID de cliente de la forma `Iv1.xxxxxxxxxxxxxxxx`, entonces ve al Paso 3.

source: A GitHub App URL is of the form `https://github.com/apps/<gh-app-name>`.
es_419: Una URL de la aplicación del GitHub tiene la forma `https://github.com/apps/<gh-app-name>`.

source: Send a ticket to the [2i2c support desk](https://docs.2i2c.org/support/) and log a feature request for `gh-scoped-creds`. 2i2c will create a GitHub App, provide a public URL of the GitHub App and update the hub configuration to make the `GH_SCOPED_CREDS_CLIENT_ID` and `GH_SCOPED_CREDS_APP_URL` environment variables available in your hub.
es_419: Envía un ticket al [escritorio de soporte 2i2c](https://docs.2i2c.org/support/) y registra una solicitud de funciones para `gh-scoped-creds`. 2i2c creará una aplicación GitHub, proporcionará una URL pública de la aplicación de GitHub y actualizará la configuración del hub para que las variables del entorno `GH_SCOPED_CREDS_CLIENT_ID` y `GH_SCOPED_CREDS_APP_URL` estén disponibles en tu hub.

source: Check that the GitHub App is installed to your GitHub Organization/GitHub personal account that owns the repositories you would like access to.
es_419: Revisa que la aplicación GitHub esté instalada en tu cuenta personal de GitHub Organization/GitHub que tenga los repositorios a los que te gustaría acceder.

source: **GitHub Organization:** Navigate to the GitHub Organization used to manage access to your hub. In this lesson we are using the [2i2c-community-showcase](https://github.com/2i2c-community-showcase) GitHub Organization to manage access to the Community Showcase Hub.
es_419: **GitHub Organization:** Navega a la GitHub Organization que utilizas para administrar el acceso a tu hub. En esta lección utilizamos la [2i2c-community-showcase](https://github.com/2i2c-community-showcase) GitHub Organization para administrar el acceso al Hub de muestra de la comunidad.

source: **GitHub personal account:** Navigate to your personal GitHub repository that you would like access to on the hub.
es_419: **Cuenta personal de GitHub:** Navega a tu repositorio personal de GitHub al que te gustaría acceder en el hub.

source: Click on *{octicon}`gear` Settings > {octicon}`hubot` GitHub Apps*.
es_419: Haz clic en *{octicon}`gear` Configuración > {octicon}`hubot` Aplicaciones de GitHub*.

source: Under *Installed GitHub Apps*, check whether the GitHub App URL provided by 2i2c matches an app in the list. In the screenshot below, the example GitHub App is called [2i2c Community Showcase Hub GitHub](https://github.com/apps/2i2c-community-showcase-hub).
es_419: En *Aplicaciones instaladas del GitHub*, revisa si la URL de la aplicación de GitHub proporcionada por 2i2c coincide con alguna aplicación de la lista. En la siguiente captura de pantalla, el ejemplo de la aplicación de GitHub se llama [Hub de muestra comunitario de 2i2c en GitHub](https://github.com/apps/2i2c-community-showcase-hub).

source: Screenshot of the Installed GitHub Apps section showing a list of installed apps, namely the 2i2c Community Showcase Hub GitHub App.
es_419: Captura de pantalla de la sección Aplicaciones del GitHub instaladas que muestra una lista de las aplicaciones instaladas, es decir, la aplicación de GitHub Hub de muestra comunitario de 2i2c.

source: If the GitHub App is not installed, then follow the next step.
es_419: Si la aplicación del GitHub no está instalada, sigue este paso.

source: If the GitHub App is installed, then go to Step 5.
es_419: Si la aplicación de GitHub está instalada, ve al paso 5.

source: [Install the GitHub App](https://docs.github.com/en/apps/using-github-apps/installing-a-github-app-from-a-third-party) to your GitHub Organization (requires GitHub Organization owner permissions) or personal GitHub account.
es_419: [Instala la aplicación GitHub](https://docs.github.com/en/apps/using-github-apps/installing-a-github-app-from-a-third-party) en tu GitHub Organization (requiere permisos del propietario de la GitHub Organization) o en tu cuenta personal de GitHub.
