Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/transfer_data.po
Languages: es_419

source: Navigate to the GitHub App URL provided by 2i2c.
es_419: Navega a la URL de la aplicación de GitHub proporcionada por 2i2c.

source: Click on the grey *Configure* button to install the GitHub app.
es_419: Haz clic en el botón gris *Configure* (Configuración) para instalar la aplicación GitHub.

source: Select the GitHub Organization/personal account that you would like to enable `gh-scoped-creds` for.
es_419: Selecciona la cuenta personal de GitHub para la que quieres activar `gh-scoped-creds`.

source: Screenshot of the page to install a GitHub App showing how you can select the organisation to enable `gh-scoped-creds` for.
es_419: Captura de pantalla de la página para instalar una aplicación del GitHub que muestra cómo puedes seleccionar la organización para habilitar `gh-scoped-creds`.

source: We highly recommend allowing access only to selected repositories for fine-grained access control. This can be re-configured again later if you wish.
es_419: Recomendamos encarecidamente que permitas el acceso únicamente a los repositorios seleccionados para el control de acceso con grano fino. Esta puede configurarse de nuevo más tarde si lo deseas.

source: Choose whether to enable `gh-scoped-creds` for all repositories or for only specific repositories and check that `Read and write access to code` is enabled.
es_419: Elige si habilitarás `gh-scoped-creds` para todos los repositorios o solo para repositorios específicos y revisa que la opción `Acceso de lectura y escritura al código` esté habilitada.

source: Screenshot of the page to install a GitHub App showing where to select the repositories you want to enable `gh-scoped-creds` for and check for which read-write permissions there are.
es_419: Captura de pantalla de la página para instalar una aplicación del GitHub que muestra dónde se seleccionan los repositorios para los que deseas habilitar `gh-scoped-creds` y revisar cuáles tienen permisos de lectura-escritura.

source: Click the green button labelled *Install*.
es_419: Haz clic en el botón verde que tiene la etiqueta *Install* (Instalar).

source: Check that the `gh-scoped-creds` package is installed in your image on the hub.
es_419: Revisa que el paquete `gh-scoped-creds` esté instalado en tu imagen en el hub.

source: Launch a server with your desired image.
es_419: Inicia un servidor con la imagen que deseas.

source: Continue with {ref}`Using gh-scoped-creds<episode-data:using-gh-scoped-creds>` as normal.
es_419: Continúa con {ref}`Usando gh-scoped-creds<episode-data:using-gh-scoped-creds>` de manera normal.

source: If you see `bash: gh-scoped-creds: command not found`, then the `gh-scoped-creds` package is not installed in the image selected for your server. See the [Hub Service Guide - Customize a community-maintained upstream image](https://docs.2i2c.org/admin/howto/environment/customize-image/) to add packages to a community-maintained upstream image.
es_419: Si el prompt no aparece y en vez de ello ves `bash: gh-scoped-creds: no se encontró el comando`, entonces gh-scoped-creds no está instalado en la imagen que seleccionaste para tu servidor. Consulta la [Guía de servicio del Hub - Personalizar una imagen de flujo ascendente mantenida por la comunidad](https://docs.2i2c.org/admin/howto/environment/customize-image/) para agregar paquetes a una imagen original mantenida por la comunidad.

source: Exercise: Push GitHub code
es_419: Ejercicio: Insertar código de GitHub

source: You use the Git JupyterLab extension to push code to a remote repository on GitHub and the following box opens:
es_419: Utiliza la extensión Git JupyterLab para enviar código a un repositorio remoto en GitHub y se abrirá el siguiente cuadro:

source: Information box asking for GitHub credentials such as username and Personal Access Token.
es_419: Cuadro de información que solicita credenciales de GitHub como nombre de usuario y token de acceso personal.

source: What should you do?
es_419: ¿Qué debes hacer?

source: Enter your GitHub username and Personal Access Token as requested, then click *Save my login temporarily*
es_419: Introduce tu nombre de usuario de GitHub y el token de acceso personal tal como se solicita y después haz clic en *Guardar mi acceso temporalmente*

source: Click *Cancel*, open a Terminal, enter the command `gh-scoped-creds` and follow the prompt
es_419: Haz clic en *Cancelar*, abre una Terminal, introduce el comando `gh-scoped-creds` y sigue el prompt

source: The correct answer is 2 – never enter your GitHub credentials (GitHub password, personal access tokens or otherwise) on any kind of shared infrastructure (e.g. private and public cloud, HPC, any remote machine) as this information will be at risk.
es_419: La respuesta correcta es 2 - Nunca introduzcas tus credenciales de GitHub (contraseña de GitHub, tokens de acceso personal o de cualquier otro tipo) en ninguna infraestructura compartida (por ejemplo, nube privada y pública, HPC, cualquier máquina remota) ya que esta información estará en riesgo.

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: Users can store small files and datasets in their home directory that will persist between sessions.
es_419: Los usuarios pueden almacenar pequeños archivos y conjuntos de datos en su directorio principal, los cuales persistirán entre sesiones.

source: Hub Champions can distribute datasets in a read-only *shared* directory.
es_419: Los Campeones y Campeonas del Hub pueden distribuir los datos a todos los usuarios del hub que estén en un directorio compartido.

source: Temporary data for intermediate files can be stored in the `/tmp` directory.
es_419: Los datos temporales para archivos intermedios pueden almacenarse en el directorio `/tmp`.

source: Cloud object storage can be used to store large datasets.
es_419: El almacenamiento de objetos en la nube se puede utilizar para almacenar conjuntos de datos grandes.

source: Use `gh-scoped-creds` to push and pull code to GitHub.
es_419: Utiliza `gh-scoped-creds` para insertar y extraer código a GitHub.

source: Please prepare for the Part Two of the workshop by completing Exercise 1 of the next episode *before* the synchronous session.
es_419: Prepárate para la Parte 2 del taller completando el Ejercicio 1 del próximo episodio *antes* de la sesión sincrónica.

source: Fun fact: `jovyan` is a play on the word "Jovian", which is the adjective form of the planet Jupiter 🪐. The word `jovyan` is used to describe members of the [Project Jupyter](https://jupyter.org/) community at large.
es_419: Hecho curioso: `jovyan` es un juego en la palabra "Jovian", que es la forma adjetiva del planeta Júpiter 🪐. La palabra `jovyan` se usa para describir a los miembros de la comunidad [Proyecto Jupyter](https://jupyter.org/) en general.
