Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/episodes/troubleshooting.po
Languages: es_419

source: Troubleshooting and providing user support
es_419: Solución de problemas y soporte al usuario

source: 🔍 OVERVIEW
es_419: 🔍 RESUMEN

source: **Questions**
es_419: **Preguntas**

source: What feedback do you have about the training?
es_419: ¿Qué comentarios tienes sobre la formación?

source: Where can you look for further help?
es_419: ¿Dónde puedes buscar más ayuda?

source: How can you prepare to support your community after this training?
es_419: ¿Cómo puedes prepararte para apoyar a tu comunidad después de esta formación?

source: **Objectives**
es_419: **Objetivos**

source: Share learning experiences from their self-guided study
es_419: Compartir las experiencias de aprendizaje sobre tu estudio autoguiado

source: Triage common problems and know where to look for help
es_419: Evaluar problemas comunes y saber dónde buscar ayuda

source: Plan a sustainable support strategy for their community
es_419: Planificar una estrategia de apoyo sostenible para tu comunidad

source: Looking back
es_419: Retrospectiva

source: Congratulations! You have completed the training on
es_419: ¡Felicidades! Completaste la formación

source: and you now possess the skills and knowledge to successfully serve the needs of your community as a Hub Champion 🎉
es_419: y ahora posees las habilidades y conocimientos para resolver con éxito las necesidades de tu comunidad como un Campeón o Campeona del Hub 🎉

source: Exercise: How did it go?
es_419: Ejercicio: ¿Cómo te fue?

source: Take a few minutes to reflect on your experience following the training on your own then, in pairs, discuss the following points:
es_419: Dedica unos minutos para reflexionar sobre tu experiencia después de la formación y luego, en parejas, discutan los siguientes puntos:

source: What did you learn that was new to you?
es_419: ¿Qué aprendizaje fue nuevo para ti?

source: What was confusing about the training?
es_419: ¿Qué te pareció confuso durante la formación?

source: What questions do you have about hub management?
es_419: ¿Qué dudas tienes sobre la administración del hub?

source: Which areas would you like to explore further?
es_419: ¿Qué áreas te gustaría explorar más?

source: Do you think your users would benefit from this lesson?
es_419: ¿Crees que tus usuarios se beneficiarán con esta lección?

source: Please write your answers in the collaborative note-taking document *before* the synchronous session for Part Two of the workshop.
es_419: Por favor, escribe tus respuestas en el documento colaborativo para la toma de notas *antes* de la sesión sincrónica para la Parte 2 del taller.

source: Your self-guided study ends here. The following will be covered in the synchronous session for Part Two of the workshop.
es_419: Tu estudio autoguiado termina aquí. La siguiente parte se cubrirá en la sesión sincrónica para la Parte 2 del taller.

source: The workshop instructor will now take some time to address a few of the common points that emerged from the discussion in the above exercise. During this time, note down how the instructor is troubleshooting and providing support to resolve an issue. Pay attention to
es_419: Ahora, el instructor del taller dedicará algún tiempo para tratar algunos de los puntos comunes que surgieron en la discusión del ejercicio anterior. Durante ese tiempo, observa cómo el instructor resuelve problemas y proporciona ayuda para resolver dificultades. Pon atención a

source: whether the issue was already covered in the Hub Champion Training
es_419: si el problema ya fue resuelto durante la formación de los Campeones y Campeonas del Hub

source: any further resources that were referenced
es_419: cualquier recurso adicional al que se haga referencia

source: the level of detail in the response
es_419: el nivel de detalle en la respuesta

source: their use of language and communication skills.
es_419: su uso del lenguaje y sus habilidades de comunicación.

source: Nobody is perfect – there is no perfect way for troubleshooting and providing user support! Prior skills and support requirements can vary significantly and part of your role as Hub Champion is helping users to help each other, as well as representing and escalating support requests to 2i2c for more technical issues.
es_419: Nadie es perfecto.¡No hay forma perfecta de solucionar problemas y proporcionar soporte al usuario! Las habilidades previas y los requisitos de apoyo pueden variar significativamente, y parte de tu papel como Campeón o Campeona del Hub es ayudar a que los usuarios se ayuden entre sí, al igual que dar seguimiento y escalar las solicitudes de soporte a 2i2c para resolver problemas más técnicos.

source: Here are some tips for success:
es_419: Estos son algunos consejos para lograr el éxito:

source: avoid dismissive language ("you *just* need to do this...", "*obviously* you have to...")
es_419: evitar el uso de un lenguaje despectivo ("*solo* necesitas hacer esto...", "*obviamente* tienes que...")

source: admit what you don't know – it's also useful for learners to watch a Hub Champion use problem-solving skills and seek out [](ref:resources) to find the answer
es_419: admitir lo que no sabes, también es útil para los estudiantes ver cómo un Campeón o Campeona del Hub utiliza sus habilidades para resolver problemas y busca [](ref:resources) para encontrar la respuesta

source: if you need to request technical support from 2i2c, then follow the support process and open a ticket [here](https://docs.2i2c.org/support/).
es_419: si necesitas soporte técnico de 2i2c, sigue el proceso de soporte y abre un ticket [aquí](https://docs.2i2c.org/support/).

source: Exercise: Where to go for help?
es_419: Ejercicio: ¿Dónde puedo obtener ayuda?

source: A user wants to use a software application that is not currently available on the hub. Rearrange the following statements in the order of action you would escalate support for this person:
es_419: Un usuario quiere utilizar una aplicación de software que no está disponible actualmente en el hub. Reorganiza las siguientes afirmaciones en el orden de acción que escalarías el apoyo para esta persona:

source: Contact the 2i2c technical support desk for assistance
es_419: Ponerse en contacto con el servicio de soporte técnico de 2i2c para obtener asistencia

source: Direct the user to the relevant documentation in the 2i2c Service Guide
es_419: Enviar al usuario a la documentación relevante en la Guía de servicio de 2i2c

source: Provide one-to-one support to guide the user through the process of pulling a custom container to the hub
es_419: Proporcionar soporte uno a uno para guiar al usuario durante el proceso de extracción de un contenedor personalizado hacia el hub

source: Find a custom container that includes the requested software application and provide the information needed to pull this container to the hub to the user
es_419: Encontrar un contenedor personalizado que incluya el software solicitado y proporcionar la información necesaria para extraer dicho contenedor hacia el hub del usuario

source: Solution
es_419: Solución

source: There are different ways in which you can approach this support request depending on your technical capacity and your own judgment. However, we recommend that you *Contact the 2i2c technical support desk for assistance* as a last resort, since there are plenty of [further resources](ref:resources) to help you before you get to this point.
es_419: Hay diferentes maneras de enfocar esta solicitud de soporte según tu capacidad técnica y tu propio juicio. Sin embargo, te recomendamos *Pónerte en contacto con el servicio de soporte técnico de 2i2c* como último recurso, ya que hay muchos [recursos adicionales](ref:resources) que te pueden ayudar antes de llegar a este punto.

source: Looking forward
es_419: Una visión hacia el futuro

source: Let's take the time to prepare a strategy for how you would like to guide and support your community after this training. Writing a plan will help provide clarity in your approach. Use the **SMART** method to write your objectives and keep your goals realistic and achievable:
es_419: Dedica un tiempo para preparar una estrategia sobre cómo te gustaría guiar y apoyar a tu comunidad después de esta formación. Escribir un plan ayudará a mantener claro tu enfoque. Usa el método **SMART** para escribir tus objetivos y mantener tus metas en un nivel realista y alcanzable:

source: Specific
es_419: Específico (Specific)

source: Clearly describe what needs to be done
es_419: Describe claramente lo que debe hacerse

source: Measurable
es_419: Medible (Measurable)

source: It should be possible to determine whether the specified goal has been achieved
es_419: Debe ser posible determinar si se alcanzó el objetivo especificado

source: Attainable
es_419: Alcanzable (Attainable)

source: What are you realistically capable of?
es_419: ¿De qué eres capaz de forma realista?

source: Relevant
es_419: Relevante (Relevant)

source: Make sure that what you commit to is within the scope of your role
es_419: Asegúrate de que te comprometes para cumplir objetivos que estén dentro del alcance de tu rol

source: Time-bound
es_419: De duración limitada (Time-bound)

source: Set a timeframe for your goal to be reached
es_419: Establece un plazo para alcanzar tu objetivo

source: Exercise: Plan your support process
es_419: Ejercicio: Planifica tu proceso de soporte

source: Build a plan for how you will support the use of your hub amongst your community. Begin by trying to answer the following questions:
es_419: Construye un plan sobre cómo apoyarás el uso de tu hub entre tu comunidad. Comienza tratando de responder las siguientes preguntas:

source: How will you communicate with your users?
es_419: ¿Cómo te comunicarás con tus usuarios?

source: Where will your users report issues?
es_419: ¿Dónde reportarán los problemas tus usuarios?

source: What needs do you anticipate from your users? How can you set them up for success?
es_419: ¿Qué necesidades anticipas de tus usuarios? ¿Cómo puedes ayudarlos para lograr el éxito?

source: How will you track whether an issue gets resolved promptly?
es_419: ¿Cómo controlarás si un problema se resuelve rápidamente?

source: What resources are available to help you when you need help?
es_419: ¿Qué recursos están disponibles para ayudarte cuando lo necesites?

source: When should you ask for technical assistance from 2i2c?
es_419: ¿Cuándo deberías pedir soporte técnico a 2i2c?

source: How much time can you commit to support activities?
es_419: ¿Cuánto tiempo puedes comprometerte para apoyar las actividades?

source: Will you set expectations of users' conduct and interactions?
es_419: ¿Establecerás expectativas de conducta e interacción con los usuarios?

source: How will you gather feedback to improve your support process?
es_419: ¿Cómo recopilarás los comentarios para mejorar tu proceso de soporte?

source: Considering your responses to the prompts above, identify which of the following resources you already have access to and which you would need to create/obtain:
es_419: Considerando tus respuestas a las preguntas anteriores, identifica a cuáles de los siguientes recursos ya tienes acceso y cuáles necesitarías crear/obtener:

source: communications platforms and channels
es_419: plataformas y canales de comunicación

source: tools for tracking issues/support requests
es_419: herramientas para dar seguimiento a problemas/solicitudes de soporte

source: documentation
es_419: documentación

source: training
es_419: formación

source: Is there anything else you need to support hub users?
es_419: ¿Hay algo más que necesites para apoyar a los usuarios del hub?

source: Wrap-up
es_419: Para finalizar

source: Thank you for following the Hub Champion Training! 🏅
es_419: ¡Gracias por completar la formación para los Campeones y Campeonas del Hub! 🏅

source: We hope you found it useful for building your skills and confidence as a Hub Champion to empower your community to make the best use of the hub service.
es_419: Esperamos que la encuentres útil para construir tus habilidades y confianza como un Campeón o Campeona del Hub, y te ayude a capacitar a tu comunidad para que hagan un mejor uso del Hub.

source: We're always looking to improve our lesson and welcome your feedback.
es_419: Siempre buscamos mejorar nuestras lecciones y agradecemos tus comentarios.

source: 🔑 KEY POINTS
es_419: 🔑 PUNTOS CLAVE

source: Part of your role as Hub Champion is to adapt and respond to the specific needs of your community
es_419: Parte de tu rol como Campeón o Campeona del Hub es adaptarse y responder a las necesidades específicas de tu comunidad

source: Consulting [further resources](ref:resources) may help you troubleshoot some common issues
es_419: Buscar [recursos adicionales](ref:resources) puede ayudarte a resolver problemas comunes

source: If you are stuck and require technical help on behalf of your users, then you can contact 2i2c through their support desk
es_419: Si no sabes qué hacer y necesitas ayuda técnica para tus usuarios, entonces puedes comunicarte con 2i2c mediante su servicio de asistencia

source: Make a plan for your support process to set yourself up for success as a Hub Champion
es_419: Crea un plan para tu proceso de soporte que te permita lograr el éxito como un Campeón o Campeona del Hub
