Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/learners/reference.po
Languages: es_419

source: Reference
es_419: Referencia

source: Further resources
es_419: Recursos adicionales

source: [Hub Service Guide](https://docs.2i2c.org/) – comprehensive documentation for Hub Champions
es_419: [Hub Service Guide](https://docs.2i2c.org/) (Guía de servicio del Hub) - Documentación completa para los Campeones y Campeonas del Hub

source: [Infrastructure Guide](https://infrastructure.2i2c.org/) – technical guide for 2i2c engineers
es_419: [Infrastructure Guide](https://infrastructure.2i2c.org/) (Guía sobre la infraestructura) - Guía técnica para ingenieros de 2i2c

source: [Code of Conduct](https://compass.2i2c.org/code-of-conduct/) – expected behavior and guidelines for 2i2c communities
es_419: [Code of Conduct](https://compass.2i2c.org/code-of-conduct/) (Código de conducta) - Comportamiento esperado y lineamientos para las comunidades de 2i2c

source: [Technical Support](https://docs.2i2c.org/support/) – request technical support
es_419: [Technical Support](https://docs.2i2c.org/support/) (Soporte técnico) - Solicitar soporte técnico

source: [GitHub Organization](https://github.com/2i2c-org) – all of 2i2c's work is open source and there are many insightful discussions found in repository issues
es_419: [GitHub Organization](https://github.com/2i2c-org) - Todo el trabajo de 2i2c's es de código abierto y pueden encontrarse muchas discusiones interesantes en el repositorio de GitHub

source: Slack channel – contact the workshop instructor for access
es_419: Canal de Slack - Comunicarse con el instructor del taller para pedir acceso

source: [Managing Software Images](episode-images)
es_419: [Managing Software Images](episode-images) (Administración de imágenes de software)

source: [Guide for Reproducible Research – Containers](https://book.the-turing-way.org/reproducible-research/renv/renv-containers) – guidance on reproducible research environments using containers by The Turing Way
es_419: [Guide for Reproducible Research - Contenedores](https://book.the-turing-way.org/reproducible-research/renv/renv-containers) (Guía de investigación reproducible - Contenedores) - Guía sobre entornos de investigación reproducibles utilizando contenedores de The Turing Way

source: [Reproducible Computational Environments Using Containers: Introduction to Docker](https://carpentries-incubator.github.io/docker-introduction/) – a lesson developed by The Carpentries community
es_419: [Reproducible Computational Environments Using Containers: Introduction to Docker](https://carpentries-incubator.github.io/docker-introduction/) (Entornos computacionales reproducibles usando contenedores: Introducción a Docker) - Una lección desarrollada por la comunidad de The Carpentries

source: [Red Hat Quay](https://quay.io/organization/2i2c) – browse the list of 2i2c-maintained hub images
es_419: [Red Hat Quay](https://quay.io/organization/2i2c) - Navega por la lista de imágenes de hub mantenidas en 2i2c

source: [Jupyter Docker Stacks](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html) – JupyterHub compatible Docker images
es_419: [Jupyter Docker Stacks](https://jupyter-docker-stacks.readthedocs.io/en/latest/using/selecting.html) (Stacks de Jupyter Docker) ‑ Imágenes de Docker compatibles con JupyterHub

source: [Rocker Project](https://rocker-project.org/images/) – for R Docker containers (note only the `binder` image is JupyterHub-compatible)
es_419: [Proyecto Rocker](https://rocker-project.org/images/) – para contenedores R Docker (ten en cuenta que solo la imagen `binder` es compatible con JupyterHub)

source: Glossary
es_419: Glosario

source: Central Processing Unit – executes computational work. The number of CPU cores needed for a job depends on how scalable the computational work is, the type and amount of work to be processed.
es_419: Central Processing Unit (Unidad Central de Procesamiento) - Ejecuta el trabajo computacional. El número de núcleos de CPU necesarios para hacer un trabajo depende de la escalabilidad del trabajo computacional, el tipo y la cantidad de trabajo a procesar.

source: An umbrella account that contains a collection of individual member accounts under one common Organization.
es_419: Una cuenta agrupada que contiene una colección de cuentas individuales de los miembros bajo una organización común.

source: A subgroup of a GitHub Organization with more fine-grained control over access permissions and notifications.
es_419: Un subgrupo de una organización de GitHub con un control más fino sobre los permisos de acceso y las notificaciones.

source: In the context of this lesson, a hub is a [JupyterHub](https://jupyter.org/hub) hosted in the cloud and managed by [2i2c](https://2i2c.org/).
es_419: En el contexto de esta lección, un hub es un [JupyterHub](https://jupyter.org/hub) alojado en la nube y administrado por [2i2c](https://2i2c.org/).

source: A multi-user hub that spawns, manages and proxies multiple instances of the single-user Jupyter notebook server.
es_419: Un centro multiusuario que genera, administra y efectúa proxies de varias instancias en el servidor de Jupyter notebook de un solo usuario.

source: Random Access Memory – a computer's "short-term memory". The amount of RAM needed for a job depends on the size of the data structures to be processed.
es_419: Random Access Memory (Memoria de Acceso Aleatorio) - Es la "memoria a corto plazo" de una computadora. La cantidad de RAM necesaria para hacer un trabajo depende del tamaño de las estructuras de datos que se van a procesar.
