Repository: czi-catalystproject/hub-champion-training
Catalog: locale/*/LC_MESSAGES/learners/setup.po
Languages: es_419

source: Setup
es_419: Configuración

source: Before joining the training, participants should be able to:
es_419: Antes de unirse al entrenamiento, los participantes deben ser capaces de:

source: Access the 2i2c [Community Showcase Hub](https://showcase.2i2c.cloud) using their GitHub account (or use their own community hub)
es_419: Acceder al [Community Showcase Hub]de 2i2c(https://showcase.2i2c.cloud) (Hub de muestra comunitario) utilizando su cuenta de GitHub (o su propio hub)

source: Know basic Git, such as pushing and pulling to a remote GitHub repository
es_419: Conocer el Git básico, como insertar y extraer en un repositorio remoto de GitHub

source: Find the shared collaborative note-taking document, e.g. CodiMD
es_419: Encuentra el documento compartido para tomar notas colaborativas, por ejemplo, CodiMD

source: Access the Slack Channel for asynchronous support
es_419: Acceder al canal de Slack para soporte asíncrono

source: Use a web browser and video conferencing, e.g. Zoom
es_419: Utilizar un navegador web y para videoconferencias, por ejemplo, Zoom

source: Read the [2i2c Code of Conduct](https://compass.2i2c.org/code-of-conduct/).
es_419: Lee el [2i2c Code of Conduct](https://compass.2i2c.org/code-of-conduct/) (Código de conducta de 2i2c).

source: If you have trouble with any of these steps, please contact the training instructor.
es_419: Si tienes problemas con alguno de estos pasos, comunícate con el instructor de la formación.

source: If you need a refresher on the fundamentals of Git, then check out:
es_419: Si necesitas recordar las bases de Git, entonces dale un vistazo a:

source: [The Software Carpentry – Version Control with Git](https://swcarpentry.github.io/git-novice/)
es_419: [The Software Carpentry – Control de versiones con Git] (https://swcarpentry.github.io/git-novice-es/)

source: [GitHub Docs – Getting started with Git](https://docs.github.com/en/get-started/getting-started-with-git)
es_419: [Documentación de GitHub – Comenzar con Git](https://docs.github.com/es/get-started/getting-started-with-git)

source: Communication channels
es_419: Canales de comunicación

source: We will primarily use Slack for communications with learners to encourage a "cohort" effect and capture discussions that would otherwise disappear from Zoom/Google Meet chat. However, we recognise that learners may join the synchronous sessions on their phones and therefore the Zoom/Google Meet chat is useful in this case.
es_419: Utilizaremos principalmente Slack para las comunicaciones con los estudiantes para promover un efecto de "cohorte" y capturar discusiones que de otro modo desaparecerían del chat de Zoom/Google Meet. Sin embargo, reconocemos que los estudiantes pueden unirse a las sesiones sincrónicas en sus teléfonos y, por lo tanto, el chat de Zoom/Google Meet es útil en este caso.
